; ModuleID = '/home/i12/mbuening/100_Dissertation/SQlite/sqlite/bld/QPR/010_local_slicing_callers1/bitcode.bc'
source_filename = "/home/i12/mbuening/100_Dissertation/SQlite/sqlite/bld/QPR/010_local_slicing_callers1/bitcode.bc"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.sqlite3_vfs = type { i32, i32, i32, %struct.sqlite3_vfs*, i8*, i8*, i32 (%struct.sqlite3_vfs*, i8*, %struct.sqlite3_file*, i32, i32*)*, i32 (%struct.sqlite3_vfs*, i8*, i32)*, i32 (%struct.sqlite3_vfs*, i8*, i32, i32*)*, i32 (%struct.sqlite3_vfs*, i8*, i32, i8*)*, i8* (%struct.sqlite3_vfs*, i8*)*, void (%struct.sqlite3_vfs*, i32, i8*)*, void ()* (%struct.sqlite3_vfs*, i8*, i8*)*, void (%struct.sqlite3_vfs*, i8*)*, i32 (%struct.sqlite3_vfs*, i32, i8*)*, i32 (%struct.sqlite3_vfs*, i32)*, i32 (%struct.sqlite3_vfs*, double*)*, i32 (%struct.sqlite3_vfs*, i32, i8*)*, i32 (%struct.sqlite3_vfs*, i64*)*, i32 (%struct.sqlite3_vfs*, i8*, void ()*)*, void ()* (%struct.sqlite3_vfs*, i8*)*, i8* (%struct.sqlite3_vfs*, i8*)* }
%struct.sqlite3_file = type { %struct.sqlite3_io_methods* }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "apnd_vfs", scope: !2, file: !3, line: 3830, type: !453, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (ssh://git@qpr-hub.iti.kit.edu:11072/qpr/dev/forks/clang-fork.git 7c12b2ae41c10b86ffc52b9494c139709e379f67) (ssh://git@qpr-hub.iti.kit.edu:11072/qpr/dev/forks/llvm-fork.git bcc8a8d97a8adac2b1b23a361f1c4befc3a0b19d)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !25, globals: !718)
!3 = !DIFile(filename: "/home/i12/mbuening/100_Dissertation/SQlite/sqlite/bld/shell.c", directory: "/home/i12/mbuening/100_Dissertation/SQlite/sqlite/bld")
!4 = !{!5, !20}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, size: 32, elements: !7)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/i12/mbuening/100_Dissertation/SQlite/sqlite/bld")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!8 = !DIEnumerator(name: "_ISupper", value: 256)
!9 = !DIEnumerator(name: "_ISlower", value: 512)
!10 = !DIEnumerator(name: "_ISalpha", value: 1024)
!11 = !DIEnumerator(name: "_ISdigit", value: 2048)
!12 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!13 = !DIEnumerator(name: "_ISspace", value: 8192)
!14 = !DIEnumerator(name: "_ISprint", value: 16384)
!15 = !DIEnumerator(name: "_ISgraph", value: 32768)
!16 = !DIEnumerator(name: "_ISblank", value: 1)
!17 = !DIEnumerator(name: "_IScntrl", value: 2)
!18 = !DIEnumerator(name: "_ISpunct", value: 4)
!19 = !DIEnumerator(name: "_ISalnum", value: 8)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__rusage_who", file: !21, line: 158, size: 32, elements: !22)
!21 = !DIFile(filename: "/usr/include/bits/resource.h", directory: "/home/i12/mbuening/100_Dissertation/SQlite/sqlite/bld")
!22 = !{!23, !24}
!23 = !DIEnumerator(name: "RUSAGE_SELF", value: 0)
!24 = !DIEnumerator(name: "RUSAGE_CHILDREN", value: -1)
!25 = !{!26, !27, !30, !31, !128, !96, !50, !129, !133, !136, !141, !69, !142, !145, !150, !172, !287, !295, !209, !347, !353, !372, !373, !391, !452, !135, !253, !107, !138, !528, !130, !29, !539, !540, !73, !223, !547, !52, !553, !569, !576, !582, !149, !711, !366}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!29 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!30 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite3expert", file: !3, line: 9034, baseType: !33)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3expert", file: !3, line: 9325, size: 66304, elements: !34)
!34 = !{!35, !36, !41, !42, !43, !60, !87, !95, !105, !106, !108, !109, !127}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "iSample", scope: !33, file: !3, line: 9326, baseType: !30, size: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !33, file: !3, line: 9327, baseType: !37, size: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite3", file: !39, line: 249, baseType: !40)
!39 = !DIFile(filename: "/home/i12/mbuening/100_Dissertation/SQlite/sqlite/bld/sqlite3.h", directory: "/home/i12/mbuening/100_Dissertation/SQlite/sqlite/bld")
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3", file: !39, line: 249, flags: DIFlagFwdDecl)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "dbm", scope: !33, file: !3, line: 9328, baseType: !37, size: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "dbv", scope: !33, file: !3, line: 9329, baseType: !37, size: 64, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "pTable", scope: !33, file: !3, line: 9330, baseType: !44, size: 64, offset: 256)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "IdxTable", file: !3, line: 9215, baseType: !46)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IdxTable", file: !3, line: 9267, size: 256, elements: !47)
!47 = !{!48, !49, !51, !59}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "nCol", scope: !46, file: !3, line: 9268, baseType: !30, size: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "zName", scope: !46, file: !3, line: 9269, baseType: !50, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "aCol", scope: !46, file: !3, line: 9270, baseType: !52, size: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "IdxColumn", file: !3, line: 9211, baseType: !54)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IdxColumn", file: !3, line: 9262, size: 192, elements: !55)
!55 = !{!56, !57, !58}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "zName", scope: !54, file: !3, line: 9263, baseType: !50, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "zColl", scope: !54, file: !3, line: 9264, baseType: !50, size: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "iPk", scope: !54, file: !3, line: 9265, baseType: !30, size: 32, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "pNext", scope: !46, file: !3, line: 9271, baseType: !44, size: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "pScan", scope: !33, file: !3, line: 9331, baseType: !61, size: 64, offset: 320)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "IdxScan", file: !3, line: 9213, baseType: !63)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IdxScan", file: !3, line: 9248, size: 448, elements: !64)
!64 = !{!65, !66, !67, !72, !84, !85, !86}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "pTab", scope: !63, file: !3, line: 9249, baseType: !44, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "iDb", scope: !63, file: !3, line: 9250, baseType: !30, size: 32, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "covering", scope: !63, file: !3, line: 9251, baseType: !68, size: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "i64", file: !3, line: 111, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite3_int64", file: !39, line: 281, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite_int64", file: !39, line: 278, baseType: !71)
!71 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "pOrder", scope: !63, file: !3, line: 9252, baseType: !73, size: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "IdxConstraint", file: !3, line: 9212, baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IdxConstraint", file: !3, line: 9235, size: 320, elements: !76)
!76 = !{!77, !78, !79, !80, !81, !82, !83}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "zColl", scope: !75, file: !3, line: 9236, baseType: !50, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "bRange", scope: !75, file: !3, line: 9237, baseType: !30, size: 32, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "iCol", scope: !75, file: !3, line: 9238, baseType: !30, size: 32, offset: 96)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "bFlag", scope: !75, file: !3, line: 9239, baseType: !30, size: 32, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "bDesc", scope: !75, file: !3, line: 9240, baseType: !30, size: 32, offset: 160)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "pNext", scope: !75, file: !3, line: 9241, baseType: !73, size: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "pLink", scope: !75, file: !3, line: 9242, baseType: !73, size: 64, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "pEq", scope: !63, file: !3, line: 9253, baseType: !73, size: 64, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "pRange", scope: !63, file: !3, line: 9254, baseType: !73, size: 64, offset: 320)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "pNextScan", scope: !63, file: !3, line: 9255, baseType: !61, size: 64, offset: 384)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "pWrite", scope: !33, file: !3, line: 9332, baseType: !88, size: 64, offset: 384)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "IdxWrite", file: !3, line: 9216, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IdxWrite", file: !3, line: 9279, size: 192, elements: !91)
!91 = !{!92, !93, !94}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "pTab", scope: !90, file: !3, line: 9280, baseType: !44, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "eOp", scope: !90, file: !3, line: 9281, baseType: !30, size: 32, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "pNext", scope: !90, file: !3, line: 9282, baseType: !88, size: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "pStatement", scope: !33, file: !3, line: 9333, baseType: !96, size: 64, offset: 448)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "IdxStatement", file: !3, line: 9214, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IdxStatement", file: !3, line: 9289, size: 320, elements: !99)
!99 = !{!100, !101, !102, !103, !104}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "iId", scope: !98, file: !3, line: 9290, baseType: !30, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "zSql", scope: !98, file: !3, line: 9291, baseType: !50, size: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "zIdx", scope: !98, file: !3, line: 9292, baseType: !50, size: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "zEQP", scope: !98, file: !3, line: 9293, baseType: !50, size: 64, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "pNext", scope: !98, file: !3, line: 9294, baseType: !96, size: 64, offset: 256)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "bRun", scope: !33, file: !3, line: 9334, baseType: !30, size: 32, offset: 512)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "pzErrmsg", scope: !33, file: !3, line: 9335, baseType: !107, size: 64, offset: 576)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !33, file: !3, line: 9336, baseType: !30, size: 32, offset: 640)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "hIdx", scope: !33, file: !3, line: 9337, baseType: !110, size: 65536, offset: 704)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "IdxHash", file: !3, line: 9309, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IdxHash", file: !3, line: 9317, size: 65536, elements: !112)
!112 = !{!113, !123}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "pFirst", scope: !111, file: !3, line: 9318, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "IdxHashEntry", file: !3, line: 9308, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IdxHashEntry", file: !3, line: 9310, size: 320, elements: !117)
!117 = !{!118, !119, !120, !121, !122}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "zKey", scope: !116, file: !3, line: 9311, baseType: !50, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "zVal", scope: !116, file: !3, line: 9312, baseType: !50, size: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "zVal2", scope: !116, file: !3, line: 9313, baseType: !50, size: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "pHashNext", scope: !116, file: !3, line: 9314, baseType: !114, size: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "pNext", scope: !116, file: !3, line: 9315, baseType: !114, size: 64, offset: 256)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "aHash", scope: !111, file: !3, line: 9319, baseType: !124, size: 65472, offset: 64)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 65472, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 1023)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "zCandidates", scope: !33, file: !3, line: 9338, baseType: !50, size: 64, offset: 66240)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite3_destructor_type", file: !39, line: 5665, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !26}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!135 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !3, line: 112, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite3_uint64", file: !39, line: 282, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite_uint64", file: !39, line: 279, baseType: !140)
!140 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !143, line: 62, baseType: !144)
!143 = !DIFile(filename: "/home/i12/mbuening/Workspace/install/reldeb-gcc/bin/../lib/clang/4.0.1/include/stddef.h", directory: "/home/i12/mbuening/100_Dissertation/SQlite/sqlite/bld")
!144 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !146, line: 69, baseType: !147)
!146 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/i12/mbuening/100_Dissertation/SQlite/sqlite/bld")
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !148, line: 150, baseType: !149)
!148 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/i12/mbuening/100_Dissertation/SQlite/sqlite/bld")
!149 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "fsdir_tab", file: !3, line: 2710, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsdir_tab", file: !3, line: 2711, size: 192, elements: !153)
!153 = !{!154}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !152, file: !3, line: 2712, baseType: !155, size: 192)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite3_vtab", file: !39, line: 6784, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3_vtab", file: !39, line: 7091, size: 192, elements: !157)
!157 = !{!158, !285, !286}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "pModule", scope: !156, file: !39, line: 7092, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite3_module", file: !39, line: 6787, baseType: !162)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3_module", file: !39, line: 6805, size: 1536, elements: !163)
!163 = !{!164, !165, !173, !174, !213, !217, !218, !228, !232, !240, !241, !242, !249, !254, !258, !259, !260, !261, !262, !271, !275, !279, !280, !281}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "iVersion", scope: !162, file: !39, line: 6806, baseType: !30, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "xCreate", scope: !162, file: !39, line: 6807, baseType: !166, size: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!30, !37, !26, !30, !169, !171, !107}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "xConnect", scope: !162, file: !39, line: 6810, baseType: !166, size: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "xBestIndex", scope: !162, file: !39, line: 6813, baseType: !175, size: 64, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!30, !172, !178}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite3_index_info", file: !39, line: 6785, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3_index_info", file: !39, line: 6945, size: 768, elements: !181)
!181 = !{!182, !183, !191, !192, !198, !204, !205, !206, !207, !208, !210, !211, !212}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nConstraint", scope: !180, file: !39, line: 6947, baseType: !30, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "aConstraint", scope: !180, file: !39, line: 6953, baseType: !184, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3_index_constraint", file: !39, line: 6948, size: 96, elements: !186)
!186 = !{!187, !188, !189, !190}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "iColumn", scope: !185, file: !39, line: 6949, baseType: !30, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !185, file: !39, line: 6950, baseType: !135, size: 8, offset: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "usable", scope: !185, file: !39, line: 6951, baseType: !135, size: 8, offset: 40)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "iTermOffset", scope: !185, file: !39, line: 6952, baseType: !30, size: 32, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "nOrderBy", scope: !180, file: !39, line: 6954, baseType: !30, size: 32, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "aOrderBy", scope: !180, file: !39, line: 6958, baseType: !193, size: 64, offset: 192)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3_index_orderby", file: !39, line: 6955, size: 64, elements: !195)
!195 = !{!196, !197}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "iColumn", scope: !194, file: !39, line: 6956, baseType: !30, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !194, file: !39, line: 6957, baseType: !135, size: 8, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "aConstraintUsage", scope: !180, file: !39, line: 6963, baseType: !199, size: 64, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3_index_constraint_usage", file: !39, line: 6960, size: 64, elements: !201)
!201 = !{!202, !203}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "argvIndex", scope: !200, file: !39, line: 6961, baseType: !30, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "omit", scope: !200, file: !39, line: 6962, baseType: !135, size: 8, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "idxNum", scope: !180, file: !39, line: 6964, baseType: !30, size: 32, offset: 320)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "idxStr", scope: !180, file: !39, line: 6965, baseType: !50, size: 64, offset: 384)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "needToFreeIdxStr", scope: !180, file: !39, line: 6966, baseType: !30, size: 32, offset: 448)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "orderByConsumed", scope: !180, file: !39, line: 6967, baseType: !30, size: 32, offset: 480)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "estimatedCost", scope: !180, file: !39, line: 6968, baseType: !209, size: 64, offset: 512)
!209 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "estimatedRows", scope: !180, file: !39, line: 6970, baseType: !69, size: 64, offset: 576)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "idxFlags", scope: !180, file: !39, line: 6972, baseType: !30, size: 32, offset: 640)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "colUsed", scope: !180, file: !39, line: 6974, baseType: !138, size: 64, offset: 704)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "xDisconnect", scope: !162, file: !39, line: 6814, baseType: !214, size: 64, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!30, !172}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "xDestroy", scope: !162, file: !39, line: 6815, baseType: !214, size: 64, offset: 320)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "xOpen", scope: !162, file: !39, line: 6816, baseType: !219, size: 64, offset: 384)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{!30, !172, !222}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite3_vtab_cursor", file: !39, line: 6786, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3_vtab_cursor", file: !39, line: 7115, size: 64, elements: !226)
!226 = !{!227}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "pVtab", scope: !225, file: !39, line: 7116, baseType: !172, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "xClose", scope: !162, file: !39, line: 6817, baseType: !229, size: 64, offset: 448)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!30, !223}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "xFilter", scope: !162, file: !39, line: 6818, baseType: !233, size: 64, offset: 512)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!30, !223, !30, !27, !30, !236}
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite3_value", file: !39, line: 4286, baseType: !239)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3_value", file: !39, line: 4286, flags: DIFlagFwdDecl)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "xNext", scope: !162, file: !39, line: 6820, baseType: !229, size: 64, offset: 576)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "xEof", scope: !162, file: !39, line: 6821, baseType: !229, size: 64, offset: 640)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "xColumn", scope: !162, file: !39, line: 6822, baseType: !243, size: 64, offset: 704)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!30, !223, !246, !30}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite3_context", file: !39, line: 4300, baseType: !248)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3_context", file: !39, line: 4300, flags: DIFlagFwdDecl)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "xRowid", scope: !162, file: !39, line: 6823, baseType: !250, size: 64, offset: 768)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!30, !223, !253}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "xUpdate", scope: !162, file: !39, line: 6824, baseType: !255, size: 64, offset: 832)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!30, !172, !30, !236, !253}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "xBegin", scope: !162, file: !39, line: 6825, baseType: !214, size: 64, offset: 896)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "xSync", scope: !162, file: !39, line: 6826, baseType: !214, size: 64, offset: 960)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "xCommit", scope: !162, file: !39, line: 6827, baseType: !214, size: 64, offset: 1024)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "xRollback", scope: !162, file: !39, line: 6828, baseType: !214, size: 64, offset: 1088)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "xFindFunction", scope: !162, file: !39, line: 6829, baseType: !263, size: 64, offset: 1152)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{!30, !172, !30, !27, !266, !270}
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{null, !246, !30, !236}
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "xRename", scope: !162, file: !39, line: 6832, baseType: !272, size: 64, offset: 1216)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!30, !172, !27}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "xSavepoint", scope: !162, file: !39, line: 6835, baseType: !276, size: 64, offset: 1280)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!30, !172, !30}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "xRelease", scope: !162, file: !39, line: 6836, baseType: !276, size: 64, offset: 1344)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "xRollbackTo", scope: !162, file: !39, line: 6837, baseType: !276, size: 64, offset: 1408)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "xShadowName", scope: !162, file: !39, line: 6840, baseType: !282, size: 64, offset: 1472)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!30, !27}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "nRef", scope: !156, file: !39, line: 7093, baseType: !30, size: 32, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "zErrMsg", scope: !156, file: !39, line: 7094, baseType: !50, size: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "fsdir_cursor", file: !3, line: 2687, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsdir_cursor", file: !3, line: 2695, size: 1600, elements: !290)
!290 = !{!291, !292, !293, !294, !305, !306, !307, !345, !346}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !289, file: !3, line: 2696, baseType: !224, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "nLvl", scope: !289, file: !3, line: 2698, baseType: !30, size: 32, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "iLvl", scope: !289, file: !3, line: 2699, baseType: !30, size: 32, offset: 96)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "aLvl", scope: !289, file: !3, line: 2700, baseType: !295, size: 64, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "FsdirLevel", file: !3, line: 2688, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FsdirLevel", file: !3, line: 2690, size: 128, elements: !298)
!298 = !{!299, !304}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "pDir", scope: !297, file: !3, line: 2691, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !302, line: 127, baseType: !303)
!302 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/i12/mbuening/100_Dissertation/SQlite/sqlite/bld")
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !302, line: 127, flags: DIFlagFwdDecl)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "zDir", scope: !297, file: !3, line: 2692, baseType: !50, size: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "zBase", scope: !289, file: !3, line: 2702, baseType: !27, size: 64, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "nBase", scope: !289, file: !3, line: 2703, baseType: !30, size: 32, offset: 256)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "sStat", scope: !289, file: !3, line: 2705, baseType: !308, size: 1152, offset: 320)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !309, line: 46, size: 1152, elements: !310)
!309 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/i12/mbuening/100_Dissertation/SQlite/sqlite/bld")
!310 = !{!311, !313, !315, !317, !318, !320, !322, !323, !324, !327, !329, !331, !339, !340, !341}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !308, file: !309, line: 48, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !148, line: 145, baseType: !144)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !308, file: !309, line: 53, baseType: !314, size: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !148, line: 148, baseType: !144)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !308, file: !309, line: 61, baseType: !316, size: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !148, line: 151, baseType: !144)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !308, file: !309, line: 62, baseType: !147, size: 32, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !308, file: !309, line: 64, baseType: !319, size: 32, offset: 224)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !148, line: 146, baseType: !149)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !308, file: !309, line: 65, baseType: !321, size: 32, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !148, line: 147, baseType: !149)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !308, file: !309, line: 67, baseType: !30, size: 32, offset: 288)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !308, file: !309, line: 69, baseType: !312, size: 64, offset: 320)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !308, file: !309, line: 74, baseType: !325, size: 64, offset: 384)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !148, line: 152, baseType: !326)
!326 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !308, file: !309, line: 78, baseType: !328, size: 64, offset: 448)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !148, line: 174, baseType: !326)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !308, file: !309, line: 80, baseType: !330, size: 64, offset: 512)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !148, line: 179, baseType: !326)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !308, file: !309, line: 91, baseType: !332, size: 128, offset: 576)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !333, line: 10, size: 128, elements: !334)
!333 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/i12/mbuening/100_Dissertation/SQlite/sqlite/bld")
!334 = !{!335, !337}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !332, file: !333, line: 12, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !148, line: 160, baseType: !326)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !332, file: !333, line: 16, baseType: !338, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !148, line: 196, baseType: !326)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !308, file: !309, line: 92, baseType: !332, size: 128, offset: 704)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !308, file: !309, line: 93, baseType: !332, size: 128, offset: 832)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !308, file: !309, line: 106, baseType: !342, size: 192, offset: 960)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 192, elements: !343)
!343 = !{!344}
!344 = !DISubrange(count: 3)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "zPath", scope: !289, file: !3, line: 2706, baseType: !50, size: 64, offset: 1472)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "iRowid", scope: !289, file: !3, line: 2707, baseType: !69, size: 64, offset: 1536)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "completion_vtab", file: !3, line: 3196, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion_vtab", file: !3, line: 3197, size: 256, elements: !350)
!350 = !{!351, !352}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !349, file: !3, line: 3198, baseType: !155, size: 192)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !349, file: !3, line: 3199, baseType: !37, size: 64, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "completion_cursor", file: !3, line: 3206, baseType: !355)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion_cursor", file: !3, line: 3207, size: 640, elements: !356)
!356 = !{!357, !358, !359, !360, !361, !362, !363, !364, !365, !369, !370, !371}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !355, file: !3, line: 3208, baseType: !224, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !355, file: !3, line: 3209, baseType: !37, size: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "nPrefix", scope: !355, file: !3, line: 3210, baseType: !30, size: 32, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "nLine", scope: !355, file: !3, line: 3210, baseType: !30, size: 32, offset: 160)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "zPrefix", scope: !355, file: !3, line: 3211, baseType: !50, size: 64, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "zLine", scope: !355, file: !3, line: 3212, baseType: !50, size: 64, offset: 256)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "zCurrentRow", scope: !355, file: !3, line: 3213, baseType: !27, size: 64, offset: 320)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "szRow", scope: !355, file: !3, line: 3214, baseType: !30, size: 32, offset: 384)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pStmt", scope: !355, file: !3, line: 3215, baseType: !366, size: 64, offset: 448)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite3_stmt", file: !39, line: 3829, baseType: !368)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3_stmt", file: !39, line: 3829, flags: DIFlagFwdDecl)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "iRowid", scope: !355, file: !3, line: 3216, baseType: !69, size: 64, offset: 512)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ePhase", scope: !355, file: !3, line: 3217, baseType: !30, size: 32, offset: 576)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !355, file: !3, line: 3218, baseType: !30, size: 32, offset: 608)
!372 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "ApndFile", file: !3, line: 3739, baseType: !375)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ApndFile", file: !3, line: 3781, size: 192, elements: !376)
!376 = !{!377, !450, !451}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !375, file: !3, line: 3782, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite3_file", file: !39, line: 684, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3_file", file: !39, line: 685, size: 64, elements: !380)
!380 = !{!381}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "pMethods", scope: !379, file: !39, line: 686, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !384)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3_io_methods", file: !39, line: 784, size: 1216, elements: !385)
!385 = !{!386, !387, !392, !396, !402, !406, !410, !414, !415, !416, !420, !424, !425, !426, !433, !437, !441, !442, !446}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "iVersion", scope: !384, file: !39, line: 785, baseType: !30, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "xClose", scope: !384, file: !39, line: 786, baseType: !388, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!30, !391}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "xRead", scope: !384, file: !39, line: 787, baseType: !393, size: 64, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!30, !391, !26, !30, !69}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "xWrite", scope: !384, file: !39, line: 788, baseType: !397, size: 64, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!30, !391, !400, !30, !69}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "xTruncate", scope: !384, file: !39, line: 789, baseType: !403, size: 64, offset: 256)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!30, !391, !69}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "xSync", scope: !384, file: !39, line: 790, baseType: !407, size: 64, offset: 320)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!30, !391, !30}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "xFileSize", scope: !384, file: !39, line: 791, baseType: !411, size: 64, offset: 384)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!30, !391, !253}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "xLock", scope: !384, file: !39, line: 792, baseType: !407, size: 64, offset: 448)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "xUnlock", scope: !384, file: !39, line: 793, baseType: !407, size: 64, offset: 512)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "xCheckReservedLock", scope: !384, file: !39, line: 794, baseType: !417, size: 64, offset: 576)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!30, !391, !128}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "xFileControl", scope: !384, file: !39, line: 795, baseType: !421, size: 64, offset: 640)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!30, !391, !30, !26}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "xSectorSize", scope: !384, file: !39, line: 796, baseType: !388, size: 64, offset: 704)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "xDeviceCharacteristics", scope: !384, file: !39, line: 797, baseType: !388, size: 64, offset: 768)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "xShmMap", scope: !384, file: !39, line: 799, baseType: !427, size: 64, offset: 832)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!30, !391, !30, !30, !30, !430}
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: null)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "xShmLock", scope: !384, file: !39, line: 800, baseType: !434, size: 64, offset: 896)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{!30, !391, !30, !30, !30}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "xShmBarrier", scope: !384, file: !39, line: 801, baseType: !438, size: 64, offset: 960)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{null, !391}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "xShmUnmap", scope: !384, file: !39, line: 802, baseType: !407, size: 64, offset: 1024)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "xFetch", scope: !384, file: !39, line: 804, baseType: !443, size: 64, offset: 1088)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!30, !391, !69, !30, !270}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "xUnfetch", scope: !384, file: !39, line: 805, baseType: !447, size: 64, offset: 1152)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!30, !391, !69, !26}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "iPgOne", scope: !375, file: !3, line: 3783, baseType: !69, size: 64, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "iMark", scope: !375, file: !3, line: 3784, baseType: !69, size: 64, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite3_vfs", file: !39, line: 1387, baseType: !454)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3_vfs", file: !39, line: 1389, size: 1344, elements: !455)
!455 = !{!456, !457, !458, !459, !460, !461, !462, !466, !470, !474, !478, !482, !486, !493, !497, !501, !505, !510, !511, !515, !520, !524}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "iVersion", scope: !454, file: !39, line: 1390, baseType: !30, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "szOsFile", scope: !454, file: !39, line: 1391, baseType: !30, size: 32, offset: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "mxPathname", scope: !454, file: !39, line: 1392, baseType: !30, size: 32, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "pNext", scope: !454, file: !39, line: 1393, baseType: !452, size: 64, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "zName", scope: !454, file: !39, line: 1394, baseType: !27, size: 64, offset: 192)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "pAppData", scope: !454, file: !39, line: 1395, baseType: !26, size: 64, offset: 256)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "xOpen", scope: !454, file: !39, line: 1396, baseType: !463, size: 64, offset: 320)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{!30, !452, !27, !391, !30, !128}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "xDelete", scope: !454, file: !39, line: 1398, baseType: !467, size: 64, offset: 384)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!30, !452, !27, !30}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "xAccess", scope: !454, file: !39, line: 1399, baseType: !471, size: 64, offset: 448)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{!30, !452, !27, !30, !128}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "xFullPathname", scope: !454, file: !39, line: 1400, baseType: !475, size: 64, offset: 512)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!30, !452, !27, !30, !50}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "xDlOpen", scope: !454, file: !39, line: 1401, baseType: !479, size: 64, offset: 576)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!26, !452, !27}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "xDlError", scope: !454, file: !39, line: 1402, baseType: !483, size: 64, offset: 640)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{null, !452, !30, !50}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "xDlSym", scope: !454, file: !39, line: 1403, baseType: !487, size: 64, offset: 704)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{!490, !452, !26, !27}
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{null}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "xDlClose", scope: !454, file: !39, line: 1404, baseType: !494, size: 64, offset: 768)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{null, !452, !26}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "xRandomness", scope: !454, file: !39, line: 1405, baseType: !498, size: 64, offset: 832)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{!30, !452, !30, !50}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "xSleep", scope: !454, file: !39, line: 1406, baseType: !502, size: 64, offset: 896)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{!30, !452, !30}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "xCurrentTime", scope: !454, file: !39, line: 1407, baseType: !506, size: 64, offset: 960)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!30, !452, !509}
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "xGetLastError", scope: !454, file: !39, line: 1408, baseType: !498, size: 64, offset: 1024)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "xCurrentTimeInt64", scope: !454, file: !39, line: 1413, baseType: !512, size: 64, offset: 1088)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!30, !452, !253}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "xSetSystemCall", scope: !454, file: !39, line: 1418, baseType: !516, size: 64, offset: 1152)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{!30, !452, !27, !519}
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite3_syscall_ptr", file: !39, line: 1388, baseType: !490)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "xGetSystemCall", scope: !454, file: !39, line: 1419, baseType: !521, size: 64, offset: 1216)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{!519, !452, !27}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "xNextSystemCall", scope: !454, file: !39, line: 1420, baseType: !525, size: 64, offset: 1280)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!27, !452, !27}
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "series_cursor", file: !3, line: 5547, baseType: !530)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "series_cursor", file: !3, line: 5548, size: 448, elements: !531)
!531 = !{!532, !533, !534, !535, !536, !537, !538}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !530, file: !3, line: 5549, baseType: !224, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "isDesc", scope: !530, file: !3, line: 5550, baseType: !30, size: 32, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "iRowid", scope: !530, file: !3, line: 5551, baseType: !69, size: 64, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "iValue", scope: !530, file: !3, line: 5552, baseType: !69, size: 64, offset: 192)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "mnValue", scope: !530, file: !3, line: 5553, baseType: !69, size: 64, offset: 256)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "mxValue", scope: !530, file: !3, line: 5554, baseType: !69, size: 64, offset: 320)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "iStep", scope: !530, file: !3, line: 5555, baseType: !69, size: 64, offset: 384)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "ReStateNumber", file: !3, line: 6010, baseType: !372)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExpertVtab", file: !3, line: 9538, baseType: !542)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExpertVtab", file: !3, line: 9539, size: 320, elements: !543)
!543 = !{!544, !545, !546}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !542, file: !3, line: 9540, baseType: !155, size: 192)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "pTab", scope: !542, file: !3, line: 9541, baseType: !44, size: 64, offset: 192)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "pExpert", scope: !542, file: !3, line: 9542, baseType: !31, size: 64, offset: 256)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExpertCsr", file: !3, line: 9545, baseType: !549)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExpertCsr", file: !3, line: 9546, size: 128, elements: !550)
!550 = !{!551, !552}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !549, file: !3, line: 9547, baseType: !224, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "pData", scope: !549, file: !3, line: 9548, baseType: !366, size: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IdxRemCtx", file: !3, line: 10599, size: 384, elements: !555)
!555 = !{!556, !557}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "nSlot", scope: !554, file: !3, line: 10600, baseType: !30, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "aSlot", scope: !554, file: !3, line: 10608, baseType: !558, size: 320, offset: 64)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 320, elements: !567)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IdxRemSlot", file: !3, line: 10601, size: 320, elements: !560)
!560 = !{!561, !562, !563, !564, !565, !566}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "eType", scope: !559, file: !3, line: 10602, baseType: !30, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "iVal", scope: !559, file: !3, line: 10603, baseType: !68, size: 64, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "rVal", scope: !559, file: !3, line: 10604, baseType: !209, size: 64, offset: 128)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "nByte", scope: !559, file: !3, line: 10605, baseType: !30, size: 32, offset: 192)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !559, file: !3, line: 10606, baseType: !30, size: 32, offset: 224)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !559, file: !3, line: 10607, baseType: !50, size: 64, offset: 256)
!567 = !{!568}
!568 = !DISubrange(count: 1)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IdxSampleCtx", file: !3, line: 10566, size: 256, elements: !571)
!571 = !{!572, !573, !574, !575}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "iTarget", scope: !570, file: !3, line: 10567, baseType: !30, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !570, file: !3, line: 10568, baseType: !209, size: 64, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "nRow", scope: !570, file: !3, line: 10569, baseType: !209, size: 64, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "nRet", scope: !570, file: !3, line: 10570, baseType: !209, size: 64, offset: 192)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "ShellState", file: !3, line: 12051, baseType: !578)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ShellState", file: !3, line: 12052, size: 4160, elements: !579)
!579 = !{!580, !581, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !705}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !578, file: !3, line: 12053, baseType: !37, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "autoExplain", scope: !578, file: !3, line: 12054, baseType: !582, size: 8, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !3, line: 113, baseType: !135)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "autoEQP", scope: !578, file: !3, line: 12055, baseType: !582, size: 8, offset: 72)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "autoEQPtest", scope: !578, file: !3, line: 12056, baseType: !582, size: 8, offset: 80)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "autoEQPtrace", scope: !578, file: !3, line: 12057, baseType: !582, size: 8, offset: 88)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "scanstatsOn", scope: !578, file: !3, line: 12058, baseType: !582, size: 8, offset: 96)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "openMode", scope: !578, file: !3, line: 12059, baseType: !582, size: 8, offset: 104)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "doXdgOpen", scope: !578, file: !3, line: 12060, baseType: !582, size: 8, offset: 112)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "nEqpLevel", scope: !578, file: !3, line: 12061, baseType: !582, size: 8, offset: 120)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "eTraceType", scope: !578, file: !3, line: 12062, baseType: !582, size: 8, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "statsOn", scope: !578, file: !3, line: 12063, baseType: !149, size: 32, offset: 160)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "mEqpLines", scope: !578, file: !3, line: 12064, baseType: !149, size: 32, offset: 192)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "outCount", scope: !578, file: !3, line: 12065, baseType: !30, size: 32, offset: 224)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "cnt", scope: !578, file: !3, line: 12066, baseType: !30, size: 32, offset: 256)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", scope: !578, file: !3, line: 12067, baseType: !30, size: 32, offset: 288)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "openFlags", scope: !578, file: !3, line: 12068, baseType: !30, size: 32, offset: 320)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !578, file: !3, line: 12069, baseType: !598, size: 64, offset: 384)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !600, line: 7, baseType: !601)
!600 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/home/i12/mbuening/100_Dissertation/SQlite/sqlite/bld")
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !602, line: 49, size: 1728, elements: !603)
!602 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "/home/i12/mbuening/100_Dissertation/SQlite/sqlite/bld")
!603 = !{!604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !619, !621, !622, !623, !624, !625, !627, !629, !632, !634, !637, !640, !641, !642, !643, !644}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !601, file: !602, line: 51, baseType: !30, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !601, file: !602, line: 54, baseType: !50, size: 64, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !601, file: !602, line: 55, baseType: !50, size: 64, offset: 128)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !601, file: !602, line: 56, baseType: !50, size: 64, offset: 192)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !601, file: !602, line: 57, baseType: !50, size: 64, offset: 256)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !601, file: !602, line: 58, baseType: !50, size: 64, offset: 320)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !601, file: !602, line: 59, baseType: !50, size: 64, offset: 384)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !601, file: !602, line: 60, baseType: !50, size: 64, offset: 448)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !601, file: !602, line: 61, baseType: !50, size: 64, offset: 512)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !601, file: !602, line: 64, baseType: !50, size: 64, offset: 576)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !601, file: !602, line: 65, baseType: !50, size: 64, offset: 640)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !601, file: !602, line: 66, baseType: !50, size: 64, offset: 704)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !601, file: !602, line: 68, baseType: !617, size: 64, offset: 768)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !602, line: 36, flags: DIFlagFwdDecl)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !601, file: !602, line: 70, baseType: !620, size: 64, offset: 832)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !601, file: !602, line: 72, baseType: !30, size: 32, offset: 896)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !601, file: !602, line: 73, baseType: !30, size: 32, offset: 928)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !601, file: !602, line: 74, baseType: !325, size: 64, offset: 960)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !601, file: !602, line: 77, baseType: !372, size: 16, offset: 1024)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !601, file: !602, line: 78, baseType: !626, size: 8, offset: 1040)
!626 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !601, file: !602, line: 79, baseType: !628, size: 8, offset: 1048)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 8, elements: !567)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !601, file: !602, line: 81, baseType: !630, size: 64, offset: 1088)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !602, line: 43, baseType: null)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !601, file: !602, line: 89, baseType: !633, size: 64, offset: 1152)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !148, line: 153, baseType: !326)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !601, file: !602, line: 91, baseType: !635, size: 64, offset: 1216)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !602, line: 37, flags: DIFlagFwdDecl)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !601, file: !602, line: 92, baseType: !638, size: 64, offset: 1280)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !602, line: 38, flags: DIFlagFwdDecl)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !601, file: !602, line: 93, baseType: !620, size: 64, offset: 1344)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !601, file: !602, line: 94, baseType: !26, size: 64, offset: 1408)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !601, file: !602, line: 95, baseType: !142, size: 64, offset: 1472)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !601, file: !602, line: 96, baseType: !30, size: 32, offset: 1536)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !601, file: !602, line: 98, baseType: !645, size: 160, offset: 1568)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 160, elements: !646)
!646 = !{!647}
!647 = !DISubrange(count: 20)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !578, file: !3, line: 12070, baseType: !598, size: 64, offset: 448)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "traceOut", scope: !578, file: !3, line: 12071, baseType: !598, size: 64, offset: 512)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "nErr", scope: !578, file: !3, line: 12072, baseType: !30, size: 32, offset: 576)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !578, file: !3, line: 12073, baseType: !30, size: 32, offset: 608)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "modePrior", scope: !578, file: !3, line: 12074, baseType: !30, size: 32, offset: 640)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "cMode", scope: !578, file: !3, line: 12075, baseType: !30, size: 32, offset: 672)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "normalMode", scope: !578, file: !3, line: 12076, baseType: !30, size: 32, offset: 704)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "writableSchema", scope: !578, file: !3, line: 12077, baseType: !30, size: 32, offset: 736)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "showHeader", scope: !578, file: !3, line: 12078, baseType: !30, size: 32, offset: 768)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "nCheck", scope: !578, file: !3, line: 12079, baseType: !30, size: 32, offset: 800)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "nProgress", scope: !578, file: !3, line: 12080, baseType: !149, size: 32, offset: 832)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "mxProgress", scope: !578, file: !3, line: 12081, baseType: !149, size: 32, offset: 864)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "flgProgress", scope: !578, file: !3, line: 12082, baseType: !149, size: 32, offset: 896)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "shellFlgs", scope: !578, file: !3, line: 12083, baseType: !149, size: 32, offset: 928)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "priorShFlgs", scope: !578, file: !3, line: 12084, baseType: !149, size: 32, offset: 960)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "szMax", scope: !578, file: !3, line: 12085, baseType: !69, size: 64, offset: 1024)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "zDestTable", scope: !578, file: !3, line: 12086, baseType: !50, size: 64, offset: 1088)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "zTempFile", scope: !578, file: !3, line: 12087, baseType: !50, size: 64, offset: 1152)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "zTestcase", scope: !578, file: !3, line: 12088, baseType: !667, size: 240, offset: 1216)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 240, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 30)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "colSeparator", scope: !578, file: !3, line: 12089, baseType: !645, size: 160, offset: 1456)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "rowSeparator", scope: !578, file: !3, line: 12090, baseType: !645, size: 160, offset: 1616)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "colSepPrior", scope: !578, file: !3, line: 12091, baseType: !645, size: 160, offset: 1776)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "rowSepPrior", scope: !578, file: !3, line: 12092, baseType: !645, size: 160, offset: 1936)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "colWidth", scope: !578, file: !3, line: 12093, baseType: !128, size: 64, offset: 2112)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "actualWidth", scope: !578, file: !3, line: 12094, baseType: !128, size: 64, offset: 2176)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "nWidth", scope: !578, file: !3, line: 12095, baseType: !30, size: 32, offset: 2240)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "nullValue", scope: !578, file: !3, line: 12096, baseType: !645, size: 160, offset: 2272)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "outfile", scope: !578, file: !3, line: 12098, baseType: !645, size: 160, offset: 2432)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "zDbFilename", scope: !578, file: !3, line: 12099, baseType: !27, size: 64, offset: 2624)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "zFreeOnClose", scope: !578, file: !3, line: 12100, baseType: !50, size: 64, offset: 2688)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "zVfs", scope: !578, file: !3, line: 12101, baseType: !27, size: 64, offset: 2752)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "pStmt", scope: !578, file: !3, line: 12102, baseType: !366, size: 64, offset: 2816)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "pLog", scope: !578, file: !3, line: 12103, baseType: !598, size: 64, offset: 2880)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "aiIndent", scope: !578, file: !3, line: 12104, baseType: !128, size: 64, offset: 2944)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "nIndent", scope: !578, file: !3, line: 12105, baseType: !30, size: 32, offset: 3008)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "iIndent", scope: !578, file: !3, line: 12106, baseType: !30, size: 32, offset: 3040)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "sGraph", scope: !578, file: !3, line: 12107, baseType: !688, size: 960, offset: 3072)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "EQPGraph", file: !3, line: 12040, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EQPGraph", file: !3, line: 12041, size: 960, elements: !690)
!690 = !{!691, !700, !701}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "pRow", scope: !689, file: !3, line: 12042, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "EQPGraphRow", file: !3, line: 12031, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EQPGraphRow", file: !3, line: 12032, size: 192, elements: !695)
!695 = !{!696, !697, !698, !699}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "iEqpId", scope: !694, file: !3, line: 12033, baseType: !30, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "iParentId", scope: !694, file: !3, line: 12034, baseType: !30, size: 32, offset: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "pNext", scope: !694, file: !3, line: 12035, baseType: !692, size: 64, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "zText", scope: !694, file: !3, line: 12036, baseType: !628, size: 8, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "pLast", scope: !689, file: !3, line: 12043, baseType: !692, size: 64, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "zPrefix", scope: !689, file: !3, line: 12044, baseType: !702, size: 800, offset: 128)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 800, elements: !703)
!703 = !{!704}
!704 = !DISubrange(count: 100)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "expert", scope: !578, file: !3, line: 12112, baseType: !706, size: 128, offset: 4032)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExpertInfo", file: !3, line: 12024, baseType: !707)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExpertInfo", file: !3, line: 12025, size: 128, elements: !708)
!708 = !{!709, !710}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "pExpert", scope: !707, file: !3, line: 12026, baseType: !31, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "bVerbose", scope: !707, file: !3, line: 12027, baseType: !30, size: 32, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "ShellText", file: !3, line: 828, baseType: !713)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ShellText", file: !3, line: 829, size: 128, elements: !714)
!714 = !{!715, !716, !717}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !713, file: !3, line: 830, baseType: !50, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !713, file: !3, line: 831, baseType: !30, size: 32, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "nAlloc", scope: !713, file: !3, line: 832, baseType: !30, size: 32, offset: 96)
!718 = !{!719, !0, !744, !749, !751, !753, !758, !767, !773}
!719 = !DIGlobalVariableExpression(var: !720)
!720 = distinct !DIGlobalVariable(name: "memtraceBase", scope: !2, file: !3, line: 4357, type: !721, isLocal: true, isDefinition: true)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite3_mem_methods", file: !39, line: 1685, baseType: !722)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3_mem_methods", file: !39, line: 1686, size: 512, elements: !723)
!723 = !{!724, !728, !729, !733, !737, !741, !742, !743}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "xMalloc", scope: !722, file: !39, line: 1687, baseType: !725, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{!26, !30}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "xFree", scope: !722, file: !39, line: 1688, baseType: !130, size: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "xRealloc", scope: !722, file: !39, line: 1689, baseType: !730, size: 64, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{!26, !26, !30}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "xSize", scope: !722, file: !39, line: 1690, baseType: !734, size: 64, offset: 192)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!30, !26}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "xRoundup", scope: !722, file: !39, line: 1691, baseType: !738, size: 64, offset: 256)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!30, !30}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "xInit", scope: !722, file: !39, line: 1692, baseType: !734, size: 64, offset: 320)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "xShutdown", scope: !722, file: !39, line: 1693, baseType: !130, size: 64, offset: 384)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "pAppData", scope: !722, file: !39, line: 1694, baseType: !26, size: 64, offset: 448)
!744 = !DIGlobalVariableExpression(var: !745)
!745 = distinct !DIGlobalVariable(name: "apvfsSqliteHdr", scope: !2, file: !3, line: 4114, type: !746, isLocal: true, isDefinition: true)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 128, elements: !747)
!747 = !{!748}
!748 = !DISubrange(count: 16)
!749 = !DIGlobalVariableExpression(var: !750)
!750 = distinct !DIGlobalVariable(name: "mainPrompt", scope: !2, file: !3, line: 476, type: !645, isLocal: true, isDefinition: true)
!751 = !DIGlobalVariableExpression(var: !752)
!752 = distinct !DIGlobalVariable(name: "continuePrompt", scope: !2, file: !3, line: 477, type: !645, isLocal: true, isDefinition: true)
!753 = !DIGlobalVariableExpression(var: !754)
!754 = distinct !DIGlobalVariable(name: "zOptions", scope: !2, file: !3, line: 21710, type: !755, isLocal: true, isDefinition: true)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 15592, elements: !756)
!756 = !{!757}
!757 = !DISubrange(count: 1949)
!758 = !DIGlobalVariableExpression(var: !759)
!759 = distinct !DIGlobalVariable(name: "zDash", scope: !760, file: !3, line: 12920, type: !764, isLocal: true, isDefinition: true)
!760 = distinct !DISubprogram(name: "print_dashes", scope: !3, file: !3, line: 12919, type: !761, isLocal: true, isDefinition: true, scopeLine: 12919, flags: DIFlagPrototyped, isOptimized: false, unit: !2, variables: !763)
!761 = !DISubroutineType(types: !762)
!762 = !{null, !598, !30}
!763 = !{}
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 408, elements: !765)
!765 = !{!766}
!766 = !DISubrange(count: 51)
!767 = !DIGlobalVariableExpression(var: !768)
!768 = distinct !DIGlobalVariable(name: "zDash", scope: !769, file: !3, line: 13970, type: !770, isLocal: true, isDefinition: true)
!769 = distinct !DISubprogram(name: "print_box_line", scope: !3, file: !3, line: 13969, type: !761, isLocal: true, isDefinition: true, scopeLine: 13969, flags: DIFlagPrototyped, isOptimized: false, unit: !2, variables: !763)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 488, elements: !771)
!771 = !{!772}
!772 = !DISubrange(count: 61)
!773 = !DIGlobalVariableExpression(var: !774)
!774 = distinct !DIGlobalVariable(name: "sBegin", scope: !2, file: !3, line: 293, type: !775, isLocal: true, isDefinition: true)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage", file: !776, line: 33, size: 1152, elements: !777)
!776 = !DIFile(filename: "/usr/include/bits/types/struct_rusage.h", directory: "/home/i12/mbuening/100_Dissertation/SQlite/sqlite/bld")
!777 = !{!778, !785, !786, !791, !796, !801, !806, !811, !816, !821, !826, !831, !836, !841, !846, !851}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "ru_utime", scope: !775, file: !776, line: 36, baseType: !779, size: 128)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !780, line: 8, size: 128, elements: !781)
!780 = !DIFile(filename: "/usr/include/bits/types/struct_timeval.h", directory: "/home/i12/mbuening/100_Dissertation/SQlite/sqlite/bld")
!781 = !{!782, !783}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !779, file: !780, line: 10, baseType: !336, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !779, file: !780, line: 11, baseType: !784, size: 64, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !148, line: 162, baseType: !326)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "ru_stime", scope: !775, file: !776, line: 38, baseType: !779, size: 128, offset: 128)
!786 = !DIDerivedType(tag: DW_TAG_member, scope: !775, file: !776, line: 40, baseType: !787, size: 64, offset: 256)
!787 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !775, file: !776, line: 40, size: 64, elements: !788)
!788 = !{!789, !790}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "ru_maxrss", scope: !787, file: !776, line: 42, baseType: !326, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_maxrss_word", scope: !787, file: !776, line: 43, baseType: !338, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, scope: !775, file: !776, line: 47, baseType: !792, size: 64, offset: 320)
!792 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !775, file: !776, line: 47, size: 64, elements: !793)
!793 = !{!794, !795}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "ru_ixrss", scope: !792, file: !776, line: 49, baseType: !326, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_ixrss_word", scope: !792, file: !776, line: 50, baseType: !338, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, scope: !775, file: !776, line: 53, baseType: !797, size: 64, offset: 384)
!797 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !775, file: !776, line: 53, size: 64, elements: !798)
!798 = !{!799, !800}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "ru_idrss", scope: !797, file: !776, line: 55, baseType: !326, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_idrss_word", scope: !797, file: !776, line: 56, baseType: !338, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, scope: !775, file: !776, line: 59, baseType: !802, size: 64, offset: 448)
!802 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !775, file: !776, line: 59, size: 64, elements: !803)
!803 = !{!804, !805}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "ru_isrss", scope: !802, file: !776, line: 61, baseType: !326, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_isrss_word", scope: !802, file: !776, line: 62, baseType: !338, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, scope: !775, file: !776, line: 66, baseType: !807, size: 64, offset: 512)
!807 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !775, file: !776, line: 66, size: 64, elements: !808)
!808 = !{!809, !810}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ru_minflt", scope: !807, file: !776, line: 68, baseType: !326, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_minflt_word", scope: !807, file: !776, line: 69, baseType: !338, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, scope: !775, file: !776, line: 72, baseType: !812, size: 64, offset: 576)
!812 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !775, file: !776, line: 72, size: 64, elements: !813)
!813 = !{!814, !815}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "ru_majflt", scope: !812, file: !776, line: 74, baseType: !326, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_majflt_word", scope: !812, file: !776, line: 75, baseType: !338, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, scope: !775, file: !776, line: 78, baseType: !817, size: 64, offset: 640)
!817 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !775, file: !776, line: 78, size: 64, elements: !818)
!818 = !{!819, !820}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nswap", scope: !817, file: !776, line: 80, baseType: !326, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_nswap_word", scope: !817, file: !776, line: 81, baseType: !338, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, scope: !775, file: !776, line: 85, baseType: !822, size: 64, offset: 704)
!822 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !775, file: !776, line: 85, size: 64, elements: !823)
!823 = !{!824, !825}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ru_inblock", scope: !822, file: !776, line: 87, baseType: !326, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_inblock_word", scope: !822, file: !776, line: 88, baseType: !338, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, scope: !775, file: !776, line: 91, baseType: !827, size: 64, offset: 768)
!827 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !775, file: !776, line: 91, size: 64, elements: !828)
!828 = !{!829, !830}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ru_oublock", scope: !827, file: !776, line: 93, baseType: !326, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_oublock_word", scope: !827, file: !776, line: 94, baseType: !338, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, scope: !775, file: !776, line: 97, baseType: !832, size: 64, offset: 832)
!832 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !775, file: !776, line: 97, size: 64, elements: !833)
!833 = !{!834, !835}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ru_msgsnd", scope: !832, file: !776, line: 99, baseType: !326, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_msgsnd_word", scope: !832, file: !776, line: 100, baseType: !338, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, scope: !775, file: !776, line: 103, baseType: !837, size: 64, offset: 896)
!837 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !775, file: !776, line: 103, size: 64, elements: !838)
!838 = !{!839, !840}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ru_msgrcv", scope: !837, file: !776, line: 105, baseType: !326, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_msgrcv_word", scope: !837, file: !776, line: 106, baseType: !338, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, scope: !775, file: !776, line: 109, baseType: !842, size: 64, offset: 960)
!842 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !775, file: !776, line: 109, size: 64, elements: !843)
!843 = !{!844, !845}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nsignals", scope: !842, file: !776, line: 111, baseType: !326, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_nsignals_word", scope: !842, file: !776, line: 112, baseType: !338, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, scope: !775, file: !776, line: 117, baseType: !847, size: 64, offset: 1024)
!847 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !775, file: !776, line: 117, size: 64, elements: !848)
!848 = !{!849, !850}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nvcsw", scope: !847, file: !776, line: 119, baseType: !326, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_nvcsw_word", scope: !847, file: !776, line: 120, baseType: !338, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, scope: !775, file: !776, line: 124, baseType: !852, size: 64, offset: 1088)
!852 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !775, file: !776, line: 124, size: 64, elements: !853)
!853 = !{!854, !855}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nivcsw", scope: !852, file: !776, line: 126, baseType: !326, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_nivcsw_word", scope: !852, file: !776, line: 127, baseType: !338, size: 64)
!856 = !DIGlobalVariableExpression(var: !857)
!857 = distinct !DIGlobalVariable(name: "sqlite3_version", scope: !858, file: !859, line: 1284, type: !4711, isLocal: false, isDefinition: true)
!858 = distinct !DICompileUnit(language: DW_LANG_C99, file: !859, producer: "clang version 4.0.1 (ssh://git@qpr-hub.iti.kit.edu:11072/qpr/dev/forks/clang-fork.git 7c12b2ae41c10b86ffc52b9494c139709e379f67) (ssh://git@qpr-hub.iti.kit.edu:11072/qpr/dev/forks/llvm-fork.git bcc8a8d97a8adac2b1b23a361f1c4befc3a0b19d)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !860, retainedTypes: !1091, globals: !4411)
!859 = !DIFile(filename: "/home/i12/mbuening/100_Dissertation/SQlite/sqlite/bld/sqlite3.c", directory: "/home/i12/mbuening/100_Dissertation/SQlite/sqlite/bld")
!860 = !{!861, !873}
!861 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !862, line: 43, size: 32, elements: !863)
!862 = !DIFile(filename: "/usr/include/pthread.h", directory: "/home/i12/mbuening/100_Dissertation/SQlite/sqlite/bld")
!863 = !{!864, !865, !866, !867, !868, !869, !870, !871, !872}
!864 = !DIEnumerator(name: "PTHREAD_MUTEX_TIMED_NP", value: 0)
!865 = !DIEnumerator(name: "PTHREAD_MUTEX_RECURSIVE_NP", value: 1)
!866 = !DIEnumerator(name: "PTHREAD_MUTEX_ERRORCHECK_NP", value: 2)
!867 = !DIEnumerator(name: "PTHREAD_MUTEX_ADAPTIVE_NP", value: 3)
!868 = !DIEnumerator(name: "PTHREAD_MUTEX_NORMAL", value: 0)
!869 = !DIEnumerator(name: "PTHREAD_MUTEX_RECURSIVE", value: 1)
!870 = !DIEnumerator(name: "PTHREAD_MUTEX_ERRORCHECK", value: 2)
!871 = !DIEnumerator(name: "PTHREAD_MUTEX_DEFAULT", value: 0)
!872 = !DIEnumerator(name: "PTHREAD_MUTEX_FAST_NP", value: 0)
!873 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !874, line: 71, size: 32, elements: !875)
!874 = !DIFile(filename: "/usr/include/bits/confname.h", directory: "/home/i12/mbuening/100_Dissertation/SQlite/sqlite/bld")
!875 = !{!876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090}
!876 = !DIEnumerator(name: "_SC_ARG_MAX", value: 0)
!877 = !DIEnumerator(name: "_SC_CHILD_MAX", value: 1)
!878 = !DIEnumerator(name: "_SC_CLK_TCK", value: 2)
!879 = !DIEnumerator(name: "_SC_NGROUPS_MAX", value: 3)
!880 = !DIEnumerator(name: "_SC_OPEN_MAX", value: 4)
!881 = !DIEnumerator(name: "_SC_STREAM_MAX", value: 5)
!882 = !DIEnumerator(name: "_SC_TZNAME_MAX", value: 6)
!883 = !DIEnumerator(name: "_SC_JOB_CONTROL", value: 7)
!884 = !DIEnumerator(name: "_SC_SAVED_IDS", value: 8)
!885 = !DIEnumerator(name: "_SC_REALTIME_SIGNALS", value: 9)
!886 = !DIEnumerator(name: "_SC_PRIORITY_SCHEDULING", value: 10)
!887 = !DIEnumerator(name: "_SC_TIMERS", value: 11)
!888 = !DIEnumerator(name: "_SC_ASYNCHRONOUS_IO", value: 12)
!889 = !DIEnumerator(name: "_SC_PRIORITIZED_IO", value: 13)
!890 = !DIEnumerator(name: "_SC_SYNCHRONIZED_IO", value: 14)
!891 = !DIEnumerator(name: "_SC_FSYNC", value: 15)
!892 = !DIEnumerator(name: "_SC_MAPPED_FILES", value: 16)
!893 = !DIEnumerator(name: "_SC_MEMLOCK", value: 17)
!894 = !DIEnumerator(name: "_SC_MEMLOCK_RANGE", value: 18)
!895 = !DIEnumerator(name: "_SC_MEMORY_PROTECTION", value: 19)
!896 = !DIEnumerator(name: "_SC_MESSAGE_PASSING", value: 20)
!897 = !DIEnumerator(name: "_SC_SEMAPHORES", value: 21)
!898 = !DIEnumerator(name: "_SC_SHARED_MEMORY_OBJECTS", value: 22)
!899 = !DIEnumerator(name: "_SC_AIO_LISTIO_MAX", value: 23)
!900 = !DIEnumerator(name: "_SC_AIO_MAX", value: 24)
!901 = !DIEnumerator(name: "_SC_AIO_PRIO_DELTA_MAX", value: 25)
!902 = !DIEnumerator(name: "_SC_DELAYTIMER_MAX", value: 26)
!903 = !DIEnumerator(name: "_SC_MQ_OPEN_MAX", value: 27)
!904 = !DIEnumerator(name: "_SC_MQ_PRIO_MAX", value: 28)
!905 = !DIEnumerator(name: "_SC_VERSION", value: 29)
!906 = !DIEnumerator(name: "_SC_PAGESIZE", value: 30)
!907 = !DIEnumerator(name: "_SC_RTSIG_MAX", value: 31)
!908 = !DIEnumerator(name: "_SC_SEM_NSEMS_MAX", value: 32)
!909 = !DIEnumerator(name: "_SC_SEM_VALUE_MAX", value: 33)
!910 = !DIEnumerator(name: "_SC_SIGQUEUE_MAX", value: 34)
!911 = !DIEnumerator(name: "_SC_TIMER_MAX", value: 35)
!912 = !DIEnumerator(name: "_SC_BC_BASE_MAX", value: 36)
!913 = !DIEnumerator(name: "_SC_BC_DIM_MAX", value: 37)
!914 = !DIEnumerator(name: "_SC_BC_SCALE_MAX", value: 38)
!915 = !DIEnumerator(name: "_SC_BC_STRING_MAX", value: 39)
!916 = !DIEnumerator(name: "_SC_COLL_WEIGHTS_MAX", value: 40)
!917 = !DIEnumerator(name: "_SC_EQUIV_CLASS_MAX", value: 41)
!918 = !DIEnumerator(name: "_SC_EXPR_NEST_MAX", value: 42)
!919 = !DIEnumerator(name: "_SC_LINE_MAX", value: 43)
!920 = !DIEnumerator(name: "_SC_RE_DUP_MAX", value: 44)
!921 = !DIEnumerator(name: "_SC_CHARCLASS_NAME_MAX", value: 45)
!922 = !DIEnumerator(name: "_SC_2_VERSION", value: 46)
!923 = !DIEnumerator(name: "_SC_2_C_BIND", value: 47)
!924 = !DIEnumerator(name: "_SC_2_C_DEV", value: 48)
!925 = !DIEnumerator(name: "_SC_2_FORT_DEV", value: 49)
!926 = !DIEnumerator(name: "_SC_2_FORT_RUN", value: 50)
!927 = !DIEnumerator(name: "_SC_2_SW_DEV", value: 51)
!928 = !DIEnumerator(name: "_SC_2_LOCALEDEF", value: 52)
!929 = !DIEnumerator(name: "_SC_PII", value: 53)
!930 = !DIEnumerator(name: "_SC_PII_XTI", value: 54)
!931 = !DIEnumerator(name: "_SC_PII_SOCKET", value: 55)
!932 = !DIEnumerator(name: "_SC_PII_INTERNET", value: 56)
!933 = !DIEnumerator(name: "_SC_PII_OSI", value: 57)
!934 = !DIEnumerator(name: "_SC_POLL", value: 58)
!935 = !DIEnumerator(name: "_SC_SELECT", value: 59)
!936 = !DIEnumerator(name: "_SC_UIO_MAXIOV", value: 60)
!937 = !DIEnumerator(name: "_SC_IOV_MAX", value: 60)
!938 = !DIEnumerator(name: "_SC_PII_INTERNET_STREAM", value: 61)
!939 = !DIEnumerator(name: "_SC_PII_INTERNET_DGRAM", value: 62)
!940 = !DIEnumerator(name: "_SC_PII_OSI_COTS", value: 63)
!941 = !DIEnumerator(name: "_SC_PII_OSI_CLTS", value: 64)
!942 = !DIEnumerator(name: "_SC_PII_OSI_M", value: 65)
!943 = !DIEnumerator(name: "_SC_T_IOV_MAX", value: 66)
!944 = !DIEnumerator(name: "_SC_THREADS", value: 67)
!945 = !DIEnumerator(name: "_SC_THREAD_SAFE_FUNCTIONS", value: 68)
!946 = !DIEnumerator(name: "_SC_GETGR_R_SIZE_MAX", value: 69)
!947 = !DIEnumerator(name: "_SC_GETPW_R_SIZE_MAX", value: 70)
!948 = !DIEnumerator(name: "_SC_LOGIN_NAME_MAX", value: 71)
!949 = !DIEnumerator(name: "_SC_TTY_NAME_MAX", value: 72)
!950 = !DIEnumerator(name: "_SC_THREAD_DESTRUCTOR_ITERATIONS", value: 73)
!951 = !DIEnumerator(name: "_SC_THREAD_KEYS_MAX", value: 74)
!952 = !DIEnumerator(name: "_SC_THREAD_STACK_MIN", value: 75)
!953 = !DIEnumerator(name: "_SC_THREAD_THREADS_MAX", value: 76)
!954 = !DIEnumerator(name: "_SC_THREAD_ATTR_STACKADDR", value: 77)
!955 = !DIEnumerator(name: "_SC_THREAD_ATTR_STACKSIZE", value: 78)
!956 = !DIEnumerator(name: "_SC_THREAD_PRIORITY_SCHEDULING", value: 79)
!957 = !DIEnumerator(name: "_SC_THREAD_PRIO_INHERIT", value: 80)
!958 = !DIEnumerator(name: "_SC_THREAD_PRIO_PROTECT", value: 81)
!959 = !DIEnumerator(name: "_SC_THREAD_PROCESS_SHARED", value: 82)
!960 = !DIEnumerator(name: "_SC_NPROCESSORS_CONF", value: 83)
!961 = !DIEnumerator(name: "_SC_NPROCESSORS_ONLN", value: 84)
!962 = !DIEnumerator(name: "_SC_PHYS_PAGES", value: 85)
!963 = !DIEnumerator(name: "_SC_AVPHYS_PAGES", value: 86)
!964 = !DIEnumerator(name: "_SC_ATEXIT_MAX", value: 87)
!965 = !DIEnumerator(name: "_SC_PASS_MAX", value: 88)
!966 = !DIEnumerator(name: "_SC_XOPEN_VERSION", value: 89)
!967 = !DIEnumerator(name: "_SC_XOPEN_XCU_VERSION", value: 90)
!968 = !DIEnumerator(name: "_SC_XOPEN_UNIX", value: 91)
!969 = !DIEnumerator(name: "_SC_XOPEN_CRYPT", value: 92)
!970 = !DIEnumerator(name: "_SC_XOPEN_ENH_I18N", value: 93)
!971 = !DIEnumerator(name: "_SC_XOPEN_SHM", value: 94)
!972 = !DIEnumerator(name: "_SC_2_CHAR_TERM", value: 95)
!973 = !DIEnumerator(name: "_SC_2_C_VERSION", value: 96)
!974 = !DIEnumerator(name: "_SC_2_UPE", value: 97)
!975 = !DIEnumerator(name: "_SC_XOPEN_XPG2", value: 98)
!976 = !DIEnumerator(name: "_SC_XOPEN_XPG3", value: 99)
!977 = !DIEnumerator(name: "_SC_XOPEN_XPG4", value: 100)
!978 = !DIEnumerator(name: "_SC_CHAR_BIT", value: 101)
!979 = !DIEnumerator(name: "_SC_CHAR_MAX", value: 102)
!980 = !DIEnumerator(name: "_SC_CHAR_MIN", value: 103)
!981 = !DIEnumerator(name: "_SC_INT_MAX", value: 104)
!982 = !DIEnumerator(name: "_SC_INT_MIN", value: 105)
!983 = !DIEnumerator(name: "_SC_LONG_BIT", value: 106)
!984 = !DIEnumerator(name: "_SC_WORD_BIT", value: 107)
!985 = !DIEnumerator(name: "_SC_MB_LEN_MAX", value: 108)
!986 = !DIEnumerator(name: "_SC_NZERO", value: 109)
!987 = !DIEnumerator(name: "_SC_SSIZE_MAX", value: 110)
!988 = !DIEnumerator(name: "_SC_SCHAR_MAX", value: 111)
!989 = !DIEnumerator(name: "_SC_SCHAR_MIN", value: 112)
!990 = !DIEnumerator(name: "_SC_SHRT_MAX", value: 113)
!991 = !DIEnumerator(name: "_SC_SHRT_MIN", value: 114)
!992 = !DIEnumerator(name: "_SC_UCHAR_MAX", value: 115)
!993 = !DIEnumerator(name: "_SC_UINT_MAX", value: 116)
!994 = !DIEnumerator(name: "_SC_ULONG_MAX", value: 117)
!995 = !DIEnumerator(name: "_SC_USHRT_MAX", value: 118)
!996 = !DIEnumerator(name: "_SC_NL_ARGMAX", value: 119)
!997 = !DIEnumerator(name: "_SC_NL_LANGMAX", value: 120)
!998 = !DIEnumerator(name: "_SC_NL_MSGMAX", value: 121)
!999 = !DIEnumerator(name: "_SC_NL_NMAX", value: 122)
!1000 = !DIEnumerator(name: "_SC_NL_SETMAX", value: 123)
!1001 = !DIEnumerator(name: "_SC_NL_TEXTMAX", value: 124)
!1002 = !DIEnumerator(name: "_SC_XBS5_ILP32_OFF32", value: 125)
!1003 = !DIEnumerator(name: "_SC_XBS5_ILP32_OFFBIG", value: 126)
!1004 = !DIEnumerator(name: "_SC_XBS5_LP64_OFF64", value: 127)
!1005 = !DIEnumerator(name: "_SC_XBS5_LPBIG_OFFBIG", value: 128)
!1006 = !DIEnumerator(name: "_SC_XOPEN_LEGACY", value: 129)
!1007 = !DIEnumerator(name: "_SC_XOPEN_REALTIME", value: 130)
!1008 = !DIEnumerator(name: "_SC_XOPEN_REALTIME_THREADS", value: 131)
!1009 = !DIEnumerator(name: "_SC_ADVISORY_INFO", value: 132)
!1010 = !DIEnumerator(name: "_SC_BARRIERS", value: 133)
!1011 = !DIEnumerator(name: "_SC_BASE", value: 134)
!1012 = !DIEnumerator(name: "_SC_C_LANG_SUPPORT", value: 135)
!1013 = !DIEnumerator(name: "_SC_C_LANG_SUPPORT_R", value: 136)
!1014 = !DIEnumerator(name: "_SC_CLOCK_SELECTION", value: 137)
!1015 = !DIEnumerator(name: "_SC_CPUTIME", value: 138)
!1016 = !DIEnumerator(name: "_SC_THREAD_CPUTIME", value: 139)
!1017 = !DIEnumerator(name: "_SC_DEVICE_IO", value: 140)
!1018 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC", value: 141)
!1019 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC_R", value: 142)
!1020 = !DIEnumerator(name: "_SC_FD_MGMT", value: 143)
!1021 = !DIEnumerator(name: "_SC_FIFO", value: 144)
!1022 = !DIEnumerator(name: "_SC_PIPE", value: 145)
!1023 = !DIEnumerator(name: "_SC_FILE_ATTRIBUTES", value: 146)
!1024 = !DIEnumerator(name: "_SC_FILE_LOCKING", value: 147)
!1025 = !DIEnumerator(name: "_SC_FILE_SYSTEM", value: 148)
!1026 = !DIEnumerator(name: "_SC_MONOTONIC_CLOCK", value: 149)
!1027 = !DIEnumerator(name: "_SC_MULTI_PROCESS", value: 150)
!1028 = !DIEnumerator(name: "_SC_SINGLE_PROCESS", value: 151)
!1029 = !DIEnumerator(name: "_SC_NETWORKING", value: 152)
!1030 = !DIEnumerator(name: "_SC_READER_WRITER_LOCKS", value: 153)
!1031 = !DIEnumerator(name: "_SC_SPIN_LOCKS", value: 154)
!1032 = !DIEnumerator(name: "_SC_REGEXP", value: 155)
!1033 = !DIEnumerator(name: "_SC_REGEX_VERSION", value: 156)
!1034 = !DIEnumerator(name: "_SC_SHELL", value: 157)
!1035 = !DIEnumerator(name: "_SC_SIGNALS", value: 158)
!1036 = !DIEnumerator(name: "_SC_SPAWN", value: 159)
!1037 = !DIEnumerator(name: "_SC_SPORADIC_SERVER", value: 160)
!1038 = !DIEnumerator(name: "_SC_THREAD_SPORADIC_SERVER", value: 161)
!1039 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE", value: 162)
!1040 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE_R", value: 163)
!1041 = !DIEnumerator(name: "_SC_TIMEOUTS", value: 164)
!1042 = !DIEnumerator(name: "_SC_TYPED_MEMORY_OBJECTS", value: 165)
!1043 = !DIEnumerator(name: "_SC_USER_GROUPS", value: 166)
!1044 = !DIEnumerator(name: "_SC_USER_GROUPS_R", value: 167)
!1045 = !DIEnumerator(name: "_SC_2_PBS", value: 168)
!1046 = !DIEnumerator(name: "_SC_2_PBS_ACCOUNTING", value: 169)
!1047 = !DIEnumerator(name: "_SC_2_PBS_LOCATE", value: 170)
!1048 = !DIEnumerator(name: "_SC_2_PBS_MESSAGE", value: 171)
!1049 = !DIEnumerator(name: "_SC_2_PBS_TRACK", value: 172)
!1050 = !DIEnumerator(name: "_SC_SYMLOOP_MAX", value: 173)
!1051 = !DIEnumerator(name: "_SC_STREAMS", value: 174)
!1052 = !DIEnumerator(name: "_SC_2_PBS_CHECKPOINT", value: 175)
!1053 = !DIEnumerator(name: "_SC_V6_ILP32_OFF32", value: 176)
!1054 = !DIEnumerator(name: "_SC_V6_ILP32_OFFBIG", value: 177)
!1055 = !DIEnumerator(name: "_SC_V6_LP64_OFF64", value: 178)
!1056 = !DIEnumerator(name: "_SC_V6_LPBIG_OFFBIG", value: 179)
!1057 = !DIEnumerator(name: "_SC_HOST_NAME_MAX", value: 180)
!1058 = !DIEnumerator(name: "_SC_TRACE", value: 181)
!1059 = !DIEnumerator(name: "_SC_TRACE_EVENT_FILTER", value: 182)
!1060 = !DIEnumerator(name: "_SC_TRACE_INHERIT", value: 183)
!1061 = !DIEnumerator(name: "_SC_TRACE_LOG", value: 184)
!1062 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_SIZE", value: 185)
!1063 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_ASSOC", value: 186)
!1064 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_LINESIZE", value: 187)
!1065 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_SIZE", value: 188)
!1066 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_ASSOC", value: 189)
!1067 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_LINESIZE", value: 190)
!1068 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_SIZE", value: 191)
!1069 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_ASSOC", value: 192)
!1070 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_LINESIZE", value: 193)
!1071 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_SIZE", value: 194)
!1072 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_ASSOC", value: 195)
!1073 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_LINESIZE", value: 196)
!1074 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_SIZE", value: 197)
