; ModuleID = '/home/i12/mbuening/100_Dissertation/BMI160/BMI160_driver/QPR/008_Local_Havoc_12_Limit2/bitcode.bc'
source_filename = "/home/i12/mbuening/100_Dissertation/BMI160/BMI160_driver/QPR/008_Local_Havoc_12_Limit2/bitcode.bc"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%0 = type { i32, i1 }
%struct.bmi160_fifo_frame = type { i8*, i16, i8, i8, i8, i16, i16, i16, i32, i8 }
%struct.bmi160_dev = type { i8, i8, i8, i32, %struct.bmi160_cfg, %struct.bmi160_cfg, %struct.bmi160_cfg, %struct.bmi160_cfg, %struct.bmi160_aux_cfg, %struct.bmi160_aux_cfg, %struct.bmi160_fifo_frame*, i8 (i8, i8, i8*, i16)*, i8 (i8, i8, i8*, i16)*, void (i32)* }
%struct.bmi160_cfg = type { i8, i8, i8, i8 }
%struct.bmi160_aux_cfg = type { i8, i8 }
%struct.bmi160_sensor_data = type { i16, i16, i16, i32 }
%struct.bmi160_int_settg = type <{ i32, i32, %struct.bmi160_int_pin_settg, %union.bmi160_int_type_cfg, i8, i8 }>
%struct.bmi160_int_pin_settg = type { i16 }
%union.bmi160_int_type_cfg = type { %struct.bmi160_acc_orient_int_cfg }
%struct.bmi160_acc_orient_int_cfg = type { i24 }
%struct.bmi160_acc_no_motion_int_cfg = type { i16, i8 }
%struct.bmi160_acc_high_g_int_cfg = type { i8, i8, i8 }
%struct.bmi160_aux_data = type { [8 x i8] }
%struct.bmi160_foc_conf = type { i8, i8, i8, i8, i8, i8 }
%struct.bmi160_offsets = type { i8, i8, i8, i16, i16, i16 }
%union.bmi160_int_status = type { %struct.bmi160_int_status_bits }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "fifoFrameStub", scope: !2, file: !3, line: 18, type: !42, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.1 (ssh://git@qpr-hub.iti.kit.edu:11072/qpr/dev/forks/clang-fork.git 7c12b2ae41c10b86ffc52b9494c139709e379f67) (ssh://git@qpr-hub.iti.kit.edu:11072/qpr/dev/forks/llvm-fork.git bcc8a8d97a8adac2b1b23a361f1c4befc3a0b19d)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !11)
!3 = !DIFile(filename: "/home/i12/mbuening/100_Dissertation/BMI160/BMI160_driver/BMI160Stubs.c", directory: "/home/i12/mbuening/100_Dissertation/BMI160/BMI160_driver")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bmi160_any_sig_motion_active_interrupt_state", file: !6, line: 1005, size: 32, elements: !7)
!6 = !DIFile(filename: "/home/i12/mbuening/100_Dissertation/BMI160/BMI160_driver/bmi160_defs.h", directory: "/home/i12/mbuening/100_Dissertation/BMI160/BMI160_driver")
!7 = !{!8, !9, !10}
!8 = !DIEnumerator(name: "BMI160_BOTH_ANY_SIG_MOTION_DISABLED", value: -1)
!9 = !DIEnumerator(name: "BMI160_ANY_MOTION_ENABLED", value: 0)
!10 = !DIEnumerator(name: "BMI160_SIG_MOTION_ENABLED", value: 1)
!11 = !{!12, !69, !0}
!12 = !DIGlobalVariableExpression(var: !13)
!13 = distinct !DIGlobalVariable(name: "configStub", scope: !2, file: !3, line: 14, type: !14, isLocal: false, isDefinition: true)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bmi160_dev", file: !6, line: 1389, size: 512, elements: !15)
!15 = !{!16, !18, !19, !20, !21, !28, !29, !30, !31, !39, !40, !57, !63, !64}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "chip_id", scope: !14, file: !6, line: 1391, baseType: !17, size: 8)
!17 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !14, file: !6, line: 1393, baseType: !17, size: 8, offset: 8)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "interface", scope: !14, file: !6, line: 1395, baseType: !17, size: 8, offset: 16)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "any_sig_sel", scope: !14, file: !6, line: 1399, baseType: !5, size: 32, offset: 32)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "accel_cfg", scope: !14, file: !6, line: 1401, baseType: !22, size: 32, offset: 64)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bmi160_cfg", file: !6, line: 930, size: 32, elements: !23)
!23 = !{!24, !25, !26, !27}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "power", scope: !22, file: !6, line: 932, baseType: !17, size: 8)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "odr", scope: !22, file: !6, line: 934, baseType: !17, size: 8, offset: 8)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !22, file: !6, line: 936, baseType: !17, size: 8, offset: 16)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "bw", scope: !22, file: !6, line: 938, baseType: !17, size: 8, offset: 24)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "prev_accel_cfg", scope: !14, file: !6, line: 1405, baseType: !22, size: 32, offset: 96)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "gyro_cfg", scope: !14, file: !6, line: 1407, baseType: !22, size: 32, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "prev_gyro_cfg", scope: !14, file: !6, line: 1411, baseType: !22, size: 32, offset: 160)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "aux_cfg", scope: !14, file: !6, line: 1413, baseType: !32, size: 16, offset: 192)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bmi160_aux_cfg", file: !6, line: 944, size: 16, elements: !33)
!33 = !{!34, !35, !36, !37, !38}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "aux_sensor_enable", scope: !32, file: !6, line: 946, baseType: !17, size: 1, flags: DIFlagBitField, extraData: i64 0)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "manual_enable", scope: !32, file: !6, line: 948, baseType: !17, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "aux_rd_burst_len", scope: !32, file: !6, line: 950, baseType: !17, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "aux_odr", scope: !32, file: !6, line: 952, baseType: !17, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "aux_i2c_addr", scope: !32, file: !6, line: 954, baseType: !17, size: 8, offset: 8)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "prev_aux_cfg", scope: !14, file: !6, line: 1417, baseType: !32, size: 16, offset: 208)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "fifo", scope: !14, file: !6, line: 1419, baseType: !41, size: 64, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bmi160_fifo_frame", file: !6, line: 1361, size: 256, elements: !43)
!43 = !{!44, !46, !48, !49, !50, !51, !52, !53, !54, !56}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !42, file: !6, line: 1363, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !42, file: !6, line: 1369, baseType: !47, size: 16, offset: 64)
!47 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_time_enable", scope: !42, file: !6, line: 1371, baseType: !17, size: 8, offset: 80)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_header_enable", scope: !42, file: !6, line: 1373, baseType: !17, size: 8, offset: 88)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_data_enable", scope: !42, file: !6, line: 1376, baseType: !17, size: 8, offset: 96)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "accel_byte_start_idx", scope: !42, file: !6, line: 1378, baseType: !47, size: 16, offset: 112)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "gyro_byte_start_idx", scope: !42, file: !6, line: 1380, baseType: !47, size: 16, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "aux_byte_start_idx", scope: !42, file: !6, line: 1382, baseType: !47, size: 16, offset: 144)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_time", scope: !42, file: !6, line: 1384, baseType: !55, size: 32, offset: 160)
!55 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "skipped_frame_count", scope: !42, file: !6, line: 1386, baseType: !17, size: 8, offset: 192)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !14, file: !6, line: 1421, baseType: !58, size: 64, offset: 320)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "bmi160_com_fptr_t", file: !6, line: 703, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!62, !17, !17, !45, !47}
!62 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !14, file: !6, line: 1423, baseType: !58, size: 64, offset: 384)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "delay_ms", scope: !14, file: !6, line: 1425, baseType: !65, size: 64, offset: 448)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "bmi160_delay_fptr_t", file: !6, line: 706, baseType: !66)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{null, !55}
!69 = !DIGlobalVariableExpression(var: !70)
!70 = distinct !DIGlobalVariable(name: "fifoDataStub", scope: !2, file: !3, line: 17, type: !71, isLocal: false, isDefinition: true)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 64, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 8)
!74 = !DIGlobalVariableExpression(var: !75)
!75 = distinct !DIGlobalVariable(name: "int_mask_lookup_table", scope: !76, file: !77, line: 67, type: !167, isLocal: false, isDefinition: true)
!76 = distinct !DICompileUnit(language: DW_LANG_C99, file: !77, producer: "clang version 4.0.1 (ssh://git@qpr-hub.iti.kit.edu:11072/qpr/dev/forks/clang-fork.git 7c12b2ae41c10b86ffc52b9494c139709e379f67) (ssh://git@qpr-hub.iti.kit.edu:11072/qpr/dev/forks/llvm-fork.git bcc8a8d97a8adac2b1b23a361f1c4befc3a0b19d)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !78, retainedTypes: !119, globals: !122)
!77 = !DIFile(filename: "/home/i12/mbuening/100_Dissertation/BMI160/BMI160_driver/bmi160.c", directory: "/home/i12/mbuening/100_Dissertation/BMI160/BMI160_driver")
!78 = !{!5, !79, !85, !101, !108, !114}
!79 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bmi160_int_channel", file: !6, line: 960, size: 32, elements: !80)
!80 = !{!81, !82, !83, !84}
!81 = !DIEnumerator(name: "BMI160_INT_CHANNEL_NONE", value: 0)
!82 = !DIEnumerator(name: "BMI160_INT_CHANNEL_1", value: 1)
!83 = !DIEnumerator(name: "BMI160_INT_CHANNEL_2", value: 2)
!84 = !DIEnumerator(name: "BMI160_INT_CHANNEL_BOTH", value: 3)
!85 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bmi160_int_types", file: !6, line: 971, size: 32, elements: !86)
!86 = !{!87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!87 = !DIEnumerator(name: "BMI160_ACC_ANY_MOTION_INT", value: 0)
!88 = !DIEnumerator(name: "BMI160_ACC_SIG_MOTION_INT", value: 1)
!89 = !DIEnumerator(name: "BMI160_STEP_DETECT_INT", value: 2)
!90 = !DIEnumerator(name: "BMI160_ACC_DOUBLE_TAP_INT", value: 3)
!91 = !DIEnumerator(name: "BMI160_ACC_SINGLE_TAP_INT", value: 4)
!92 = !DIEnumerator(name: "BMI160_ACC_ORIENT_INT", value: 5)
!93 = !DIEnumerator(name: "BMI160_ACC_FLAT_INT", value: 6)
!94 = !DIEnumerator(name: "BMI160_ACC_HIGH_G_INT", value: 7)
!95 = !DIEnumerator(name: "BMI160_ACC_LOW_G_INT", value: 8)
!96 = !DIEnumerator(name: "BMI160_ACC_SLOW_NO_MOTION_INT", value: 9)
!97 = !DIEnumerator(name: "BMI160_ACC_GYRO_DATA_RDY_INT", value: 10)
!98 = !DIEnumerator(name: "BMI160_ACC_GYRO_FIFO_FULL_INT", value: 11)
!99 = !DIEnumerator(name: "BMI160_ACC_GYRO_FIFO_WATERMARK_INT", value: 12)
!100 = !DIEnumerator(name: "BMI160_FIFO_TAG_INT_PIN", value: 13)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bmi160_int_status_sel", file: !6, line: 712, size: 32, elements: !102)
!102 = !{!103, !104, !105, !106, !107}
!103 = !DIEnumerator(name: "BMI160_INT_STATUS_0", value: 1)
!104 = !DIEnumerator(name: "BMI160_INT_STATUS_1", value: 2)
!105 = !DIEnumerator(name: "BMI160_INT_STATUS_2", value: 4)
!106 = !DIEnumerator(name: "BMI160_INT_STATUS_3", value: 8)
!107 = !DIEnumerator(name: "BMI160_INT_STATUS_ALL", value: 15)
!108 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bmi160_step_detect_mode", file: !6, line: 910, size: 32, elements: !109)
!109 = !{!110, !111, !112, !113}
!110 = !DIEnumerator(name: "BMI160_STEP_DETECT_NORMAL", value: 0)
!111 = !DIEnumerator(name: "BMI160_STEP_DETECT_SENSITIVE", value: 1)
!112 = !DIEnumerator(name: "BMI160_STEP_DETECT_ROBUST", value: 2)
!113 = !DIEnumerator(name: "BMI160_STEP_DETECT_USER_DEFINE", value: 3)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bmi160_select_sensor", file: !6, line: 901, size: 32, elements: !115)
!115 = !{!116, !117, !118}
!116 = !DIEnumerator(name: "BMI160_ACCEL_ONLY", value: 1)
!117 = !DIEnumerator(name: "BMI160_GYRO_ONLY", value: 2)
!118 = !DIEnumerator(name: "BMI160_BOTH_ACCEL_AND_GYRO", value: 3)
!119 = !{!120, !17, !62, !121, !47, !55}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!121 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!122 = !{!74, !123}
!123 = !DIGlobalVariableExpression(var: !124)
!124 = distinct !DIGlobalVariable(name: "configStub", scope: !76, file: !77, line: 57, type: !125, isLocal: false, isDefinition: true)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bmi160_dev", file: !6, line: 1389, size: 512, elements: !126)
!126 = !{!127, !128, !129, !130, !131, !138, !139, !140, !141, !149, !150, !164, !165, !166}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "chip_id", scope: !125, file: !6, line: 1391, baseType: !17, size: 8)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !125, file: !6, line: 1393, baseType: !17, size: 8, offset: 8)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "interface", scope: !125, file: !6, line: 1395, baseType: !17, size: 8, offset: 16)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "any_sig_sel", scope: !125, file: !6, line: 1399, baseType: !5, size: 32, offset: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "accel_cfg", scope: !125, file: !6, line: 1401, baseType: !132, size: 32, offset: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bmi160_cfg", file: !6, line: 930, size: 32, elements: !133)
!133 = !{!134, !135, !136, !137}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "power", scope: !132, file: !6, line: 932, baseType: !17, size: 8)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "odr", scope: !132, file: !6, line: 934, baseType: !17, size: 8, offset: 8)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !132, file: !6, line: 936, baseType: !17, size: 8, offset: 16)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "bw", scope: !132, file: !6, line: 938, baseType: !17, size: 8, offset: 24)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "prev_accel_cfg", scope: !125, file: !6, line: 1405, baseType: !132, size: 32, offset: 96)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "gyro_cfg", scope: !125, file: !6, line: 1407, baseType: !132, size: 32, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "prev_gyro_cfg", scope: !125, file: !6, line: 1411, baseType: !132, size: 32, offset: 160)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "aux_cfg", scope: !125, file: !6, line: 1413, baseType: !142, size: 16, offset: 192)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bmi160_aux_cfg", file: !6, line: 944, size: 16, elements: !143)
!143 = !{!144, !145, !146, !147, !148}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "aux_sensor_enable", scope: !142, file: !6, line: 946, baseType: !17, size: 1, flags: DIFlagBitField, extraData: i64 0)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "manual_enable", scope: !142, file: !6, line: 948, baseType: !17, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "aux_rd_burst_len", scope: !142, file: !6, line: 950, baseType: !17, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "aux_odr", scope: !142, file: !6, line: 952, baseType: !17, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "aux_i2c_addr", scope: !142, file: !6, line: 954, baseType: !17, size: 8, offset: 8)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "prev_aux_cfg", scope: !125, file: !6, line: 1417, baseType: !142, size: 16, offset: 208)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "fifo", scope: !125, file: !6, line: 1419, baseType: !151, size: 64, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bmi160_fifo_frame", file: !6, line: 1361, size: 256, elements: !153)
!153 = !{!154, !155, !156, !157, !158, !159, !160, !161, !162, !163}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !152, file: !6, line: 1363, baseType: !45, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !152, file: !6, line: 1369, baseType: !47, size: 16, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_time_enable", scope: !152, file: !6, line: 1371, baseType: !17, size: 8, offset: 80)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_header_enable", scope: !152, file: !6, line: 1373, baseType: !17, size: 8, offset: 88)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_data_enable", scope: !152, file: !6, line: 1376, baseType: !17, size: 8, offset: 96)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "accel_byte_start_idx", scope: !152, file: !6, line: 1378, baseType: !47, size: 16, offset: 112)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "gyro_byte_start_idx", scope: !152, file: !6, line: 1380, baseType: !47, size: 16, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "aux_byte_start_idx", scope: !152, file: !6, line: 1382, baseType: !47, size: 16, offset: 144)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_time", scope: !152, file: !6, line: 1384, baseType: !55, size: 32, offset: 160)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "skipped_frame_count", scope: !152, file: !6, line: 1386, baseType: !17, size: 8, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !125, file: !6, line: 1421, baseType: !58, size: 64, offset: 320)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !125, file: !6, line: 1423, baseType: !58, size: 64, offset: 384)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "delay_ms", scope: !125, file: !6, line: 1425, baseType: !65, size: 64, offset: 448)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 104, elements: !169)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!169 = !{!170}
!170 = !DISubrange(count: 13)
!171 = !{i32 2, !"Dwarf Version", i32 4}
!172 = !{i32 2, !"Debug Info Version", i32 3}
!173 = !{!"clang version 4.0.1 (ssh://git@qpr-hub.iti.kit.edu:11072/qpr/dev/forks/clang-fork.git 7c12b2ae41c10b86ffc52b9494c139709e379f67) (ssh://git@qpr-hub.iti.kit.edu:11072/qpr/dev/forks/llvm-fork.git bcc8a8d97a8adac2b1b23a361f1c4befc3a0b19d)"}
!174 = distinct !DISubprogram(name: "stubDelay", scope: !3, file: !3, line: 20, type: !67, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: false, unit: !2, variables: !175)
!175 = !{}
!176 = !DILocalVariable(name: "unused", arg: 1, scope: !174, file: !3, line: 20, type: !55)
!177 = !DIExpression()
!178 = !DILocation(line: 20, column: 25, scope: !174)
!179 = !DILocation(line: 21, column: 1, scope: !174)
!180 = distinct !DISubprogram(name: "stubRead", scope: !3, file: !3, line: 23, type: !60, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: false, unit: !2, variables: !175)
!181 = !DILocalVariable(name: "unused1", arg: 1, scope: !180, file: !3, line: 23, type: !17)
!182 = !DILocation(line: 23, column: 25, scope: !180)
!183 = !DILocalVariable(name: "unused2", arg: 2, scope: !180, file: !3, line: 23, type: !17)
!184 = !DILocation(line: 23, column: 42, scope: !180)
!185 = !DILocalVariable(name: "data", arg: 3, scope: !180, file: !3, line: 23, type: !45)
!186 = !DILocation(line: 23, column: 60, scope: !180)
!187 = !DILocalVariable(name: "len", arg: 4, scope: !180, file: !3, line: 23, type: !47)
!188 = !DILocation(line: 23, column: 75, scope: !180)
!189 = !DILocalVariable(name: "i", scope: !180, file: !3, line: 24, type: !55)
!190 = !DILocation(line: 24, column: 16, scope: !180)
!191 = !DILocalVariable(name: "x", scope: !180, file: !3, line: 28, type: !62)
!192 = !DILocation(line: 28, column: 10, scope: !180)
!193 = !DILocation(line: 25, column: 3, scope: !180)
!194 = !DILocation(line: 25, column: 13, scope: !195)
!195 = !DILexicalBlockFile(scope: !196, file: !3, discriminator: 1)
!196 = distinct !DILexicalBlock(scope: !197, file: !3, line: 25, column: 3)
!197 = distinct !DILexicalBlock(scope: !180, file: !3, line: 25, column: 3)
!198 = !DILocation(line: 25, column: 11, scope: !195)
!199 = !DILocation(line: 25, column: 3, scope: !200)
!200 = !DILexicalBlockFile(scope: !197, file: !3, discriminator: 1)
!201 = !DILocation(line: 26, column: 15, scope: !202)
!202 = distinct !DILexicalBlock(scope: !196, file: !3, line: 25, column: 23)
!203 = !DILocation(line: 26, column: 5, scope: !202)
!204 = !DILocation(line: 26, column: 13, scope: !202)
!205 = !DILocation(line: 27, column: 3, scope: !202)
!206 = !DILocation(line: 25, column: 18, scope: !207)
!207 = !DILexicalBlockFile(scope: !196, file: !3, discriminator: 2)
!208 = !DILocation(line: 25, column: 3, scope: !207)
!209 = distinct !{!209, !210, !211}
!210 = !DILocation(line: 25, column: 3, scope: !197)
!211 = !DILocation(line: 27, column: 3, scope: !197)
!212 = !DILocation(line: 28, column: 14, scope: !180)
!213 = !DILocation(line: 29, column: 18, scope: !180)
!214 = !DILocation(line: 29, column: 20, scope: !180)
!215 = !DILocation(line: 29, column: 25, scope: !180)
!216 = !DILocation(line: 29, column: 28, scope: !217)
!217 = !DILexicalBlockFile(scope: !180, file: !3, discriminator: 1)
!218 = !DILocation(line: 29, column: 30, scope: !217)
!219 = !DILocation(line: 29, column: 25, scope: !217)
!220 = !DILocation(line: 29, column: 25, scope: !221)
!221 = !DILexicalBlockFile(scope: !180, file: !3, discriminator: 2)
!222 = !DILocation(line: 29, column: 3, scope: !221)
!223 = !DILocation(line: 30, column: 3, scope: !180)
!224 = distinct !DISubprogram(name: "stubWrite", scope: !3, file: !3, line: 33, type: !60, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: false, unit: !2, variables: !175)
!225 = !DILocalVariable(name: "unused1", arg: 1, scope: !224, file: !3, line: 33, type: !17)
!226 = !DILocation(line: 33, column: 26, scope: !224)
!227 = !DILocalVariable(name: "unused2", arg: 2, scope: !224, file: !3, line: 33, type: !17)
!228 = !DILocation(line: 33, column: 43, scope: !224)
!229 = !DILocalVariable(name: "unused3", arg: 3, scope: !224, file: !3, line: 33, type: !45)
!230 = !DILocation(line: 33, column: 61, scope: !224)
!231 = !DILocalVariable(name: "unused4", arg: 4, scope: !224, file: !3, line: 33, type: !47)
!232 = !DILocation(line: 33, column: 79, scope: !224)
!233 = !DILocation(line: 34, column: 10, scope: !224)
!234 = !DILocation(line: 34, column: 3, scope: !224)
!235 = distinct !DISubprogram(name: "initStubs", scope: !3, file: !3, line: 37, type: !236, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: false, unit: !2, variables: !175)
!236 = !DISubroutineType(types: !237)
!237 = !{null}
!238 = !DILocation(line: 40, column: 19, scope: !235)
!239 = !DILocation(line: 41, column: 14, scope: !235)
!240 = !DILocation(line: 41, column: 20, scope: !235)
!241 = !DILocation(line: 41, column: 25, scope: !235)
!242 = !DILocation(line: 42, column: 14, scope: !235)
!243 = !DILocation(line: 42, column: 20, scope: !235)
!244 = !DILocation(line: 42, column: 27, scope: !235)
!245 = !DILocation(line: 44, column: 19, scope: !235)
!246 = !DILocation(line: 45, column: 20, scope: !235)
!247 = !DILocation(line: 46, column: 23, scope: !235)
!248 = !DILocation(line: 47, column: 1, scope: !235)
!249 = distinct !DISubprogram(name: "bmi160_get_regs", scope: !77, file: !77, line: 1365, type: !250, isLocal: false, isDefinition: true, scopeLine: 1366, flags: DIFlagPrototyped, isOptimized: false, unit: !76, variables: !175)
!250 = !DISubroutineType(types: !251)
!251 = !{!62, !17, !45, !47, !252}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!254 = !DILocalVariable(name: "reg_addr", arg: 1, scope: !249, file: !77, line: 1365, type: !17)
!255 = !DILocation(line: 1365, column: 32, scope: !249)
!256 = !DILocalVariable(name: "data", arg: 2, scope: !249, file: !77, line: 1365, type: !45)
!257 = !DILocation(line: 1365, column: 51, scope: !249)
!258 = !DILocalVariable(name: "len", arg: 3, scope: !249, file: !77, line: 1365, type: !47)
!259 = !DILocation(line: 1365, column: 66, scope: !249)
!260 = !DILocalVariable(name: "dev", arg: 4, scope: !249, file: !77, line: 1365, type: !252)
!261 = !DILocation(line: 1365, column: 96, scope: !249)
!262 = !DILocalVariable(name: "rslt", scope: !249, file: !77, line: 1367, type: !62)
!263 = !DILocation(line: 1367, column: 9, scope: !249)
!264 = !DILocation(line: 1366, column: 3, scope: !249)
!265 = !DILocation(line: 1369, column: 11, scope: !266)
!266 = distinct !DILexicalBlock(scope: !249, file: !77, line: 1369, column: 6)
!267 = !DILocation(line: 1369, column: 20, scope: !266)
!268 = !DILocation(line: 1369, column: 29, scope: !269)
!269 = !DILexicalBlockFile(scope: !266, file: !77, discriminator: 1)
!270 = !DILocation(line: 1369, column: 34, scope: !269)
!271 = !DILocation(line: 1369, column: 6, scope: !272)
!272 = !DILexicalBlockFile(scope: !249, file: !77, discriminator: 1)
!273 = !DILocation(line: 1370, column: 8, scope: !274)
!274 = distinct !DILexicalBlock(scope: !266, file: !77, line: 1369, column: 44)
!275 = !DILocation(line: 1371, column: 2, scope: !274)
!276 = !DILocation(line: 1373, column: 12, scope: !277)
!277 = distinct !DILexicalBlock(scope: !278, file: !77, line: 1373, column: 7)
!278 = distinct !DILexicalBlock(scope: !266, file: !77, line: 1371, column: 9)
!279 = !DILocation(line: 1373, column: 7, scope: !277)
!280 = !DILocation(line: 1373, column: 22, scope: !277)
!281 = !DILocation(line: 1373, column: 7, scope: !278)
!282 = !DILocation(line: 1374, column: 16, scope: !277)
!283 = !DILocation(line: 1374, column: 25, scope: !277)
!284 = !DILocation(line: 1374, column: 15, scope: !277)
!285 = !DILocation(line: 1374, column: 13, scope: !277)
!286 = !DILocation(line: 1374, column: 4, scope: !277)
!287 = !DILocation(line: 1376, column: 15, scope: !278)
!288 = !DILocation(line: 1376, column: 25, scope: !278)
!289 = !DILocation(line: 1376, column: 10, scope: !278)
!290 = !DILocation(line: 1376, column: 8, scope: !278)
!291 = !DILocation(line: 1378, column: 8, scope: !278)
!292 = !DILocation(line: 1378, column: 3, scope: !278)
!293 = !DILocation(line: 1379, column: 7, scope: !294)
!294 = distinct !DILexicalBlock(scope: !278, file: !77, line: 1379, column: 7)
!295 = !DILocation(line: 1379, column: 12, scope: !294)
!296 = !DILocation(line: 1379, column: 7, scope: !278)
!297 = !DILocation(line: 1380, column: 9, scope: !294)
!298 = !DILocation(line: 1380, column: 4, scope: !294)
!299 = !DILocation(line: 1383, column: 2, scope: !249)
!300 = distinct !DISubprogram(name: "bmi160_set_regs", scope: !77, file: !77, line: 1391, type: !250, isLocal: false, isDefinition: true, scopeLine: 1392, flags: DIFlagPrototyped, isOptimized: false, unit: !76, variables: !175)
!301 = !DILocalVariable(name: "reg_addr", arg: 1, scope: !300, file: !77, line: 1391, type: !17)
!302 = !DILocation(line: 1391, column: 32, scope: !300)
!303 = !DILocalVariable(name: "data", arg: 2, scope: !300, file: !77, line: 1391, type: !45)
!304 = !DILocation(line: 1391, column: 51, scope: !300)
!305 = !DILocalVariable(name: "len", arg: 3, scope: !300, file: !77, line: 1391, type: !47)
!306 = !DILocation(line: 1391, column: 66, scope: !300)
!307 = !DILocalVariable(name: "dev", arg: 4, scope: !300, file: !77, line: 1391, type: !252)
!308 = !DILocation(line: 1391, column: 96, scope: !300)
!309 = !DILocalVariable(name: "rslt", scope: !300, file: !77, line: 1393, type: !62)
!310 = !DILocation(line: 1393, column: 9, scope: !300)
!311 = !DILocalVariable(name: "count", scope: !300, file: !77, line: 1394, type: !17)
!312 = !DILocation(line: 1394, column: 10, scope: !300)
!313 = !DILocation(line: 1392, column: 3, scope: !300)
!314 = !DILocation(line: 1412, column: 4, scope: !300)
!315 = !DILocation(line: 1412, column: 11, scope: !316)
!316 = !DILexicalBlockFile(scope: !317, file: !77, discriminator: 1)
!317 = distinct !DILexicalBlock(scope: !318, file: !77, line: 1412, column: 4)
!318 = distinct !DILexicalBlock(scope: !300, file: !77, line: 1412, column: 4)
!319 = !DILocation(line: 1412, column: 19, scope: !316)
!320 = !DILocation(line: 1412, column: 17, scope: !316)
!321 = !DILocation(line: 1412, column: 4, scope: !322)
!322 = !DILexicalBlockFile(scope: !318, file: !77, discriminator: 1)
!323 = !DILocation(line: 1413, column: 17, scope: !324)
!324 = distinct !DILexicalBlock(scope: !317, file: !77, line: 1412, column: 33)
!325 = !DILocation(line: 1413, column: 28, scope: !324)
!326 = !DILocation(line: 1413, column: 43, scope: !324)
!327 = !DILocation(line: 1413, column: 12, scope: !324)
!328 = !DILocation(line: 1413, column: 10, scope: !324)
!329 = !DILocation(line: 1414, column: 13, scope: !324)
!330 = !DILocation(line: 1417, column: 4, scope: !324)
!331 = !DILocation(line: 1412, column: 29, scope: !332)
!332 = !DILexicalBlockFile(scope: !317, file: !77, discriminator: 2)
!333 = !DILocation(line: 1412, column: 4, scope: !332)
!334 = distinct !{!334, !335, !336}
!335 = !DILocation(line: 1412, column: 4, scope: !318)
!336 = !DILocation(line: 1417, column: 4, scope: !318)
!337 = !DILocation(line: 1424, column: 2, scope: !300)
!338 = distinct !DISubprogram(name: "bmi160_init", scope: !77, file: !77, line: 1432, type: !339, isLocal: false, isDefinition: true, scopeLine: 1433, flags: DIFlagPrototyped, isOptimized: false, unit: !76, variables: !175)
!339 = !DISubroutineType(types: !340)
!340 = !{!62, !341}
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!342 = !DILocalVariable(name: "dev", arg: 1, scope: !338, file: !77, line: 1432, type: !341)
!343 = !DILocation(line: 1432, column: 39, scope: !338)
!344 = !DILocalVariable(name: "rslt", scope: !338, file: !77, line: 1434, type: !62)
!345 = !DILocation(line: 1434, column: 9, scope: !338)
!346 = !DILocalVariable(name: "try", scope: !338, file: !77, line: 1436, type: !17)
!347 = !DILocation(line: 1436, column: 10, scope: !338)
!348 = !DILocation(line: 1433, column: 3, scope: !338)
!349 = !DILocalVariable(name: "data", scope: !338, file: !77, line: 1435, type: !17)
!350 = !DILocation(line: 1435, column: 10, scope: !338)
!351 = !DILocation(line: 1439, column: 7, scope: !338)
!352 = !DILocation(line: 1439, column: 15, scope: !338)
!353 = !DILocation(line: 1442, column: 9, scope: !338)
!354 = !DILocation(line: 1442, column: 7, scope: !338)
!355 = !DILocation(line: 1446, column: 7, scope: !356)
!356 = distinct !DILexicalBlock(scope: !338, file: !77, line: 1446, column: 6)
!357 = !DILocation(line: 1446, column: 12, scope: !356)
!358 = !DILocation(line: 1446, column: 26, scope: !356)
!359 = !DILocation(line: 1446, column: 35, scope: !360)
!360 = !DILexicalBlockFile(scope: !356, file: !77, discriminator: 1)
!361 = !DILocation(line: 1446, column: 30, scope: !360)
!362 = !DILocation(line: 1446, column: 45, scope: !360)
!363 = !DILocation(line: 1446, column: 6, scope: !364)
!364 = !DILexicalBlockFile(scope: !338, file: !77, discriminator: 1)
!365 = !DILocation(line: 1447, column: 10, scope: !356)
!366 = !DILocation(line: 1447, column: 8, scope: !356)
!367 = !DILocation(line: 1447, column: 3, scope: !356)
!368 = !DILocation(line: 1449, column: 6, scope: !369)
!369 = distinct !DILexicalBlock(scope: !338, file: !77, line: 1449, column: 6)
!370 = !DILocation(line: 1449, column: 11, scope: !369)
!371 = !DILocation(line: 1449, column: 6, scope: !338)
!372 = !DILocation(line: 1451, column: 3, scope: !373)
!373 = distinct !DILexicalBlock(scope: !369, file: !77, line: 1449, column: 25)
!374 = !DILocation(line: 1451, column: 14, scope: !375)
!375 = !DILexicalBlockFile(scope: !373, file: !77, discriminator: 1)
!376 = !DILocation(line: 1451, column: 10, scope: !375)
!377 = !DILocation(line: 1451, column: 18, scope: !375)
!378 = !DILocation(line: 1451, column: 27, scope: !379)
!379 = !DILexicalBlockFile(scope: !373, file: !77, discriminator: 2)
!380 = !DILocation(line: 1451, column: 22, scope: !379)
!381 = !DILocation(line: 1451, column: 35, scope: !379)
!382 = !DILocation(line: 1451, column: 3, scope: !383)
!383 = !DILexicalBlockFile(scope: !373, file: !77, discriminator: 3)
!384 = !DILocation(line: 1453, column: 54, scope: !385)
!385 = distinct !DILexicalBlock(scope: !373, file: !77, line: 1451, column: 55)
!386 = !DILocation(line: 1453, column: 11, scope: !385)
!387 = !DILocation(line: 1453, column: 9, scope: !385)
!388 = !DILocation(line: 1451, column: 3, scope: !389)
!389 = !DILexicalBlockFile(scope: !373, file: !77, discriminator: 4)
!390 = distinct !{!390, !372, !391}
!391 = !DILocation(line: 1454, column: 3, scope: !373)
!392 = !DILocation(line: 1456, column: 8, scope: !393)
!393 = distinct !DILexicalBlock(scope: !373, file: !77, line: 1456, column: 7)
!394 = !DILocation(line: 1456, column: 13, scope: !393)
!395 = !DILocation(line: 1456, column: 27, scope: !393)
!396 = !DILocation(line: 1456, column: 36, scope: !397)
!397 = !DILexicalBlockFile(scope: !393, file: !77, discriminator: 1)
!398 = !DILocation(line: 1456, column: 31, scope: !397)
!399 = !DILocation(line: 1456, column: 44, scope: !397)
!400 = !DILocation(line: 1456, column: 7, scope: !375)
!401 = !DILocation(line: 1457, column: 9, scope: !402)
!402 = distinct !DILexicalBlock(scope: !393, file: !77, line: 1456, column: 64)
!403 = !DILocation(line: 1457, column: 21, scope: !402)
!404 = !DILocation(line: 1459, column: 11, scope: !402)
!405 = !DILocation(line: 1459, column: 9, scope: !402)
!406 = !DILocation(line: 1460, column: 3, scope: !402)
!407 = !DILocation(line: 1461, column: 9, scope: !408)
!408 = distinct !DILexicalBlock(scope: !393, file: !77, line: 1460, column: 10)
!409 = !DILocation(line: 1463, column: 2, scope: !373)
!410 = !DILocation(line: 1465, column: 2, scope: !338)
!411 = distinct !DISubprogram(name: "null_ptr_check", scope: !77, file: !77, line: 2786, type: !412, isLocal: true, isDefinition: true, scopeLine: 2787, flags: DIFlagPrototyped, isOptimized: false, unit: !76, variables: !175)
!412 = !DISubroutineType(types: !413)
!413 = !{!62, !252}
!414 = !DILocalVariable(name: "dev", arg: 1, scope: !411, file: !77, line: 2786, type: !252)
!415 = !DILocation(line: 2786, column: 55, scope: !411)
!416 = !DILocalVariable(name: "rslt", scope: !411, file: !77, line: 2788, type: !62)
!417 = !DILocation(line: 2788, column: 9, scope: !411)
!418 = !DILocation(line: 2787, column: 3, scope: !411)
!419 = !DILocation(line: 2790, column: 11, scope: !420)
!420 = distinct !DILexicalBlock(scope: !411, file: !77, line: 2790, column: 6)
!421 = !DILocation(line: 2790, column: 20, scope: !420)
!422 = !DILocation(line: 2790, column: 29, scope: !423)
!423 = !DILexicalBlockFile(scope: !420, file: !77, discriminator: 1)
!424 = !DILocation(line: 2790, column: 34, scope: !423)
!425 = !DILocation(line: 2790, column: 43, scope: !423)
!426 = !DILocation(line: 2790, column: 52, scope: !427)
!427 = !DILexicalBlockFile(scope: !420, file: !77, discriminator: 2)
!428 = !DILocation(line: 2790, column: 58, scope: !427)
!429 = !DILocation(line: 2790, column: 67, scope: !427)
!430 = !DILocation(line: 2790, column: 76, scope: !431)
!431 = !DILexicalBlockFile(scope: !420, file: !77, discriminator: 3)
!432 = !DILocation(line: 2790, column: 85, scope: !431)
!433 = !DILocation(line: 2790, column: 6, scope: !434)
!434 = !DILexicalBlockFile(scope: !411, file: !77, discriminator: 3)
!435 = !DILocation(line: 2791, column: 8, scope: !436)
!436 = distinct !DILexicalBlock(scope: !420, file: !77, line: 2790, column: 95)
!437 = !DILocation(line: 2792, column: 2, scope: !436)
!438 = !DILocation(line: 2794, column: 8, scope: !439)
!439 = distinct !DILexicalBlock(scope: !420, file: !77, line: 2792, column: 9)
!440 = !DILocation(line: 2797, column: 2, scope: !411)
!441 = distinct !DISubprogram(name: "bmi160_soft_reset", scope: !77, file: !77, line: 1472, type: !339, isLocal: false, isDefinition: true, scopeLine: 1473, flags: DIFlagPrototyped, isOptimized: false, unit: !76, variables: !175)
!442 = !DILocalVariable(name: "dev", arg: 1, scope: !441, file: !77, line: 1472, type: !341)
!443 = !DILocation(line: 1472, column: 45, scope: !441)
!444 = !DILocalVariable(name: "rslt", scope: !441, file: !77, line: 1474, type: !62)
!445 = !DILocation(line: 1474, column: 9, scope: !441)
!446 = !DILocation(line: 1473, column: 3, scope: !441)
!447 = !DILocalVariable(name: "data", scope: !441, file: !77, line: 1475, type: !17)
!448 = !DILocation(line: 1475, column: 10, scope: !441)
!449 = !DILocation(line: 1478, column: 11, scope: !450)
!450 = distinct !DILexicalBlock(scope: !441, file: !77, line: 1478, column: 6)
!451 = !DILocation(line: 1478, column: 20, scope: !450)
!452 = !DILocation(line: 1478, column: 29, scope: !453)
!453 = !DILexicalBlockFile(scope: !450, file: !77, discriminator: 1)
!454 = !DILocation(line: 1478, column: 38, scope: !453)
!455 = !DILocation(line: 1478, column: 6, scope: !456)
!456 = !DILexicalBlockFile(scope: !441, file: !77, discriminator: 1)
!457 = !DILocation(line: 1479, column: 8, scope: !458)
!458 = distinct !DILexicalBlock(scope: !450, file: !77, line: 1478, column: 48)
!459 = !DILocation(line: 1480, column: 2, scope: !458)
!460 = !DILocation(line: 1482, column: 10, scope: !461)
!461 = distinct !DILexicalBlock(scope: !450, file: !77, line: 1480, column: 9)
!462 = !DILocation(line: 1482, column: 8, scope: !461)
!463 = !DILocation(line: 1483, column: 8, scope: !461)
!464 = !DILocation(line: 1483, column: 3, scope: !461)
!465 = !DILocation(line: 1484, column: 8, scope: !466)
!466 = distinct !DILexicalBlock(scope: !461, file: !77, line: 1484, column: 7)
!467 = !DILocation(line: 1484, column: 13, scope: !466)
!468 = !DILocation(line: 1484, column: 27, scope: !466)
!469 = !DILocation(line: 1484, column: 36, scope: !470)
!470 = !DILexicalBlockFile(scope: !466, file: !77, discriminator: 1)
!471 = !DILocation(line: 1484, column: 31, scope: !470)
!472 = !DILocation(line: 1484, column: 46, scope: !470)
!473 = !DILocation(line: 1484, column: 7, scope: !474)
!474 = !DILexicalBlockFile(scope: !461, file: !77, discriminator: 1)
!475 = !DILocation(line: 1487, column: 11, scope: !476)
!476 = distinct !DILexicalBlock(scope: !466, file: !77, line: 1484, column: 67)
!477 = !DILocation(line: 1487, column: 9, scope: !476)
!478 = !DILocation(line: 1488, column: 3, scope: !476)
!479 = !DILocation(line: 1489, column: 7, scope: !480)
!480 = distinct !DILexicalBlock(scope: !461, file: !77, line: 1489, column: 7)
!481 = !DILocation(line: 1489, column: 12, scope: !480)
!482 = !DILocation(line: 1489, column: 7, scope: !461)
!483 = !DILocation(line: 1491, column: 4, scope: !484)
!484 = distinct !DILexicalBlock(scope: !480, file: !77, line: 1489, column: 26)
!485 = !DILocation(line: 1492, column: 3, scope: !484)
!486 = !DILocation(line: 1495, column: 2, scope: !441)
!487 = distinct !DISubprogram(name: "default_param_settg", scope: !77, file: !77, line: 2804, type: !488, isLocal: true, isDefinition: true, scopeLine: 2805, flags: DIFlagPrototyped, isOptimized: false, unit: !76, variables: !175)
!488 = !DISubroutineType(types: !489)
!489 = !{null, !341}
!490 = !DILocalVariable(name: "dev", arg: 1, scope: !487, file: !77, line: 2804, type: !341)
!491 = !DILocation(line: 2804, column: 52, scope: !487)
!492 = !DILocation(line: 2805, column: 3, scope: !487)
!493 = !DILocation(line: 2808, column: 7, scope: !487)
!494 = !DILocation(line: 2808, column: 17, scope: !487)
!495 = !DILocation(line: 2808, column: 20, scope: !487)
!496 = !DILocation(line: 2809, column: 7, scope: !487)
!497 = !DILocation(line: 2809, column: 17, scope: !487)
!498 = !DILocation(line: 2809, column: 21, scope: !487)
!499 = !DILocation(line: 2810, column: 7, scope: !487)
!500 = !DILocation(line: 2810, column: 17, scope: !487)
!501 = !DILocation(line: 2810, column: 23, scope: !487)
!502 = !DILocation(line: 2811, column: 7, scope: !487)
!503 = !DILocation(line: 2811, column: 17, scope: !487)
!504 = !DILocation(line: 2811, column: 23, scope: !487)
!505 = !DILocation(line: 2812, column: 7, scope: !487)
!506 = !DILocation(line: 2812, column: 16, scope: !487)
!507 = !DILocation(line: 2812, column: 19, scope: !487)
!508 = !DILocation(line: 2813, column: 7, scope: !487)
!509 = !DILocation(line: 2813, column: 16, scope: !487)
!510 = !DILocation(line: 2813, column: 20, scope: !487)
!511 = !DILocation(line: 2814, column: 7, scope: !487)
!512 = !DILocation(line: 2814, column: 16, scope: !487)
!513 = !DILocation(line: 2814, column: 22, scope: !487)
!514 = !DILocation(line: 2815, column: 7, scope: !487)
!515 = !DILocation(line: 2815, column: 16, scope: !487)
!516 = !DILocation(line: 2815, column: 22, scope: !487)
!517 = !DILocation(line: 2818, column: 7, scope: !487)
!518 = !DILocation(line: 2818, column: 29, scope: !487)
!519 = !DILocation(line: 2820, column: 7, scope: !487)
!520 = !DILocation(line: 2820, column: 28, scope: !487)
!521 = !DILocation(line: 2821, column: 1, scope: !487)
!522 = distinct !DISubprogram(name: "bmi160_set_sens_conf", scope: !77, file: !77, line: 1502, type: !339, isLocal: false, isDefinition: true, scopeLine: 1503, flags: DIFlagPrototyped, isOptimized: false, unit: !76, variables: !175)
!523 = !DILocalVariable(name: "dev", arg: 1, scope: !522, file: !77, line: 1502, type: !341)
!524 = !DILocation(line: 1502, column: 48, scope: !522)
!525 = !DILocalVariable(name: "rslt", scope: !522, file: !77, line: 1504, type: !62)
!526 = !DILocation(line: 1504, column: 9, scope: !522)
!527 = !DILocation(line: 1503, column: 3, scope: !522)
!528 = !DILocation(line: 1507, column: 11, scope: !529)
!529 = distinct !DILexicalBlock(scope: !522, file: !77, line: 1507, column: 6)
!530 = !DILocation(line: 1507, column: 20, scope: !529)
!531 = !DILocation(line: 1507, column: 29, scope: !532)
!532 = !DILexicalBlockFile(scope: !529, file: !77, discriminator: 1)
!533 = !DILocation(line: 1507, column: 38, scope: !532)
!534 = !DILocation(line: 1507, column: 6, scope: !535)
!535 = !DILexicalBlockFile(scope: !522, file: !77, discriminator: 1)
!536 = !DILocation(line: 1508, column: 8, scope: !537)
!537 = distinct !DILexicalBlock(scope: !529, file: !77, line: 1507, column: 48)
!538 = !DILocation(line: 1509, column: 2, scope: !537)
!539 = !DILocation(line: 1510, column: 10, scope: !540)
!540 = distinct !DILexicalBlock(scope: !529, file: !77, line: 1509, column: 9)
!541 = !DILocation(line: 1510, column: 8, scope: !540)
!542 = !DILocation(line: 1511, column: 7, scope: !543)
!543 = distinct !DILexicalBlock(scope: !540, file: !77, line: 1511, column: 7)
!544 = !DILocation(line: 1511, column: 12, scope: !543)
!545 = !DILocation(line: 1511, column: 7, scope: !540)
!546 = !DILocation(line: 1512, column: 11, scope: !547)
!547 = distinct !DILexicalBlock(scope: !543, file: !77, line: 1511, column: 26)
!548 = !DILocation(line: 1512, column: 9, scope: !547)
!549 = !DILocation(line: 1513, column: 8, scope: !550)
!550 = distinct !DILexicalBlock(scope: !547, file: !77, line: 1513, column: 8)
!551 = !DILocation(line: 1513, column: 13, scope: !550)
!552 = !DILocation(line: 1513, column: 8, scope: !547)
!553 = !DILocation(line: 1515, column: 12, scope: !554)
!554 = distinct !DILexicalBlock(scope: !550, file: !77, line: 1513, column: 27)
!555 = !DILocation(line: 1515, column: 10, scope: !554)
!556 = !DILocation(line: 1516, column: 9, scope: !557)
!557 = distinct !DILexicalBlock(scope: !554, file: !77, line: 1516, column: 9)
!558 = !DILocation(line: 1516, column: 14, scope: !557)
!559 = !DILocation(line: 1516, column: 9, scope: !554)
!560 = !DILocation(line: 1517, column: 13, scope: !557)
!561 = !DILocation(line: 1517, column: 11, scope: !557)
!562 = !DILocation(line: 1517, column: 6, scope: !557)
!563 = !DILocation(line: 1518, column: 4, scope: !554)
!564 = !DILocation(line: 1519, column: 3, scope: !547)
!565 = !DILocation(line: 1522, column: 2, scope: !522)
!566 = distinct !DISubprogram(name: "set_accel_conf", scope: !77, file: !77, line: 2826, type: !339, isLocal: true, isDefinition: true, scopeLine: 2827, flags: DIFlagPrototyped, isOptimized: false, unit: !76, variables: !175)
!567 = !DILocalVariable(name: "dev", arg: 1, scope: !566, file: !77, line: 2826, type: !341)
!568 = !DILocation(line: 2826, column: 49, scope: !566)
!569 = !DILocalVariable(name: "rslt", scope: !566, file: !77, line: 2828, type: !62)
!570 = !DILocation(line: 2828, column: 9, scope: !566)
!571 = !DILocation(line: 2827, column: 3, scope: !566)
!572 = !DILocalVariable(name: "data", scope: !566, file: !77, line: 2829, type: !573)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 16, elements: !574)
!574 = !{!575}
!575 = !DISubrange(count: 2)
!576 = !DILocation(line: 2829, column: 10, scope: !566)
!577 = !DILocation(line: 2831, column: 28, scope: !566)
!578 = !DILocation(line: 2831, column: 9, scope: !566)
!579 = !DILocation(line: 2831, column: 7, scope: !566)
!580 = !DILocation(line: 2832, column: 6, scope: !581)
!581 = distinct !DILexicalBlock(scope: !566, file: !77, line: 2832, column: 6)
!582 = !DILocation(line: 2832, column: 11, scope: !581)
!583 = !DILocation(line: 2832, column: 6, scope: !566)
!584 = !DILocation(line: 2834, column: 53, scope: !585)
!585 = distinct !DILexicalBlock(scope: !581, file: !77, line: 2832, column: 25)
!586 = !DILocation(line: 2834, column: 10, scope: !585)
!587 = !DILocation(line: 2834, column: 8, scope: !585)
!588 = !DILocation(line: 2835, column: 7, scope: !589)
!589 = distinct !DILexicalBlock(scope: !585, file: !77, line: 2835, column: 7)
!590 = !DILocation(line: 2835, column: 12, scope: !589)
!591 = !DILocation(line: 2835, column: 7, scope: !585)
!592 = !DILocation(line: 2836, column: 35, scope: !593)
!593 = distinct !DILexicalBlock(scope: !589, file: !77, line: 2835, column: 26)
!594 = !DILocation(line: 2836, column: 45, scope: !593)
!595 = !DILocation(line: 2836, column: 9, scope: !593)
!596 = !DILocation(line: 2836, column: 24, scope: !593)
!597 = !DILocation(line: 2836, column: 28, scope: !593)
!598 = !DILocation(line: 2837, column: 34, scope: !593)
!599 = !DILocation(line: 2837, column: 44, scope: !593)
!600 = !DILocation(line: 2837, column: 9, scope: !593)
!601 = !DILocation(line: 2837, column: 24, scope: !593)
!602 = !DILocation(line: 2837, column: 27, scope: !593)
!603 = !DILocation(line: 2838, column: 9, scope: !593)
!604 = !DILocation(line: 2838, column: 4, scope: !593)
!605 = !DILocation(line: 2840, column: 53, scope: !593)
!606 = !DILocation(line: 2840, column: 11, scope: !593)
!607 = !DILocation(line: 2840, column: 9, scope: !593)
!608 = !DILocation(line: 2841, column: 8, scope: !609)
!609 = distinct !DILexicalBlock(scope: !593, file: !77, line: 2841, column: 8)
!610 = !DILocation(line: 2841, column: 13, scope: !609)
!611 = !DILocation(line: 2841, column: 8, scope: !593)
!612 = !DILocation(line: 2842, column: 38, scope: !609)
!613 = !DILocation(line: 2842, column: 48, scope: !609)
!614 = !DILocation(line: 2842, column: 10, scope: !609)
!615 = !DILocation(line: 2842, column: 25, scope: !609)
!616 = !DILocation(line: 2842, column: 31, scope: !609)
!617 = !DILocation(line: 2842, column: 5, scope: !609)
!618 = !DILocation(line: 2843, column: 3, scope: !593)
!619 = !DILocation(line: 2844, column: 2, scope: !585)
!620 = !DILocation(line: 2846, column: 2, scope: !566)
!621 = distinct !DISubprogram(name: "set_gyro_conf", scope: !77, file: !77, line: 2965, type: !339, isLocal: true, isDefinition: true, scopeLine: 2966, flags: DIFlagPrototyped, isOptimized: false, unit: !76, variables: !175)
!622 = !DILocalVariable(name: "dev", arg: 1, scope: !621, file: !77, line: 2965, type: !341)
!623 = !DILocation(line: 2965, column: 48, scope: !621)
!624 = !DILocalVariable(name: "rslt", scope: !621, file: !77, line: 2967, type: !62)
!625 = !DILocation(line: 2967, column: 9, scope: !621)
!626 = !DILocation(line: 2966, column: 3, scope: !621)
!627 = !DILocalVariable(name: "data", scope: !621, file: !77, line: 2968, type: !573)
!628 = !DILocation(line: 2968, column: 10, scope: !621)
!629 = !DILocation(line: 2970, column: 27, scope: !621)
!630 = !DILocation(line: 2970, column: 9, scope: !621)
!631 = !DILocation(line: 2970, column: 7, scope: !621)
!632 = !DILocation(line: 2971, column: 6, scope: !633)
!633 = distinct !DILexicalBlock(scope: !621, file: !77, line: 2971, column: 6)
!634 = !DILocation(line: 2971, column: 11, scope: !633)
!635 = !DILocation(line: 2971, column: 6, scope: !621)
!636 = !DILocation(line: 2973, column: 52, scope: !637)
!637 = distinct !DILexicalBlock(scope: !633, file: !77, line: 2971, column: 25)
!638 = !DILocation(line: 2973, column: 10, scope: !637)
!639 = !DILocation(line: 2973, column: 8, scope: !637)
!640 = !DILocation(line: 2974, column: 7, scope: !641)
!641 = distinct !DILexicalBlock(scope: !637, file: !77, line: 2974, column: 7)
!642 = !DILocation(line: 2974, column: 12, scope: !641)
!643 = !DILocation(line: 2974, column: 7, scope: !637)
!644 = !DILocation(line: 2975, column: 34, scope: !645)
!645 = distinct !DILexicalBlock(scope: !641, file: !77, line: 2974, column: 26)
!646 = !DILocation(line: 2975, column: 43, scope: !645)
!647 = !DILocation(line: 2975, column: 9, scope: !645)
!648 = !DILocation(line: 2975, column: 23, scope: !645)
!649 = !DILocation(line: 2975, column: 27, scope: !645)
!650 = !DILocation(line: 2976, column: 33, scope: !645)
!651 = !DILocation(line: 2976, column: 42, scope: !645)
!652 = !DILocation(line: 2976, column: 9, scope: !645)
!653 = !DILocation(line: 2976, column: 23, scope: !645)
!654 = !DILocation(line: 2976, column: 26, scope: !645)
!655 = !DILocation(line: 2977, column: 9, scope: !645)
!656 = !DILocation(line: 2977, column: 4, scope: !645)
!657 = !DILocation(line: 2979, column: 52, scope: !645)
!658 = !DILocation(line: 2979, column: 11, scope: !645)
!659 = !DILocation(line: 2979, column: 9, scope: !645)
!660 = !DILocation(line: 2980, column: 8, scope: !661)
!661 = distinct !DILexicalBlock(scope: !645, file: !77, line: 2980, column: 8)
!662 = !DILocation(line: 2980, column: 13, scope: !661)
!663 = !DILocation(line: 2980, column: 8, scope: !645)
!664 = !DILocation(line: 2981, column: 37, scope: !661)
!665 = !DILocation(line: 2981, column: 46, scope: !661)
!666 = !DILocation(line: 2981, column: 10, scope: !661)
!667 = !DILocation(line: 2981, column: 24, scope: !661)
!668 = !DILocation(line: 2981, column: 30, scope: !661)
!669 = !DILocation(line: 2981, column: 5, scope: !661)
!670 = !DILocation(line: 2982, column: 3, scope: !645)
!671 = !DILocation(line: 2983, column: 2, scope: !637)
!672 = !DILocation(line: 2985, column: 2, scope: !621)
!673 = distinct !DISubprogram(name: "bmi160_set_power_mode", scope: !77, file: !77, line: 1528, type: !339, isLocal: false, isDefinition: true, scopeLine: 1529, flags: DIFlagPrototyped, isOptimized: false, unit: !76, variables: !175)
!674 = !DILocalVariable(name: "dev", arg: 1, scope: !673, file: !77, line: 1528, type: !341)
!675 = !DILocation(line: 1528, column: 49, scope: !673)
!676 = !DILocalVariable(name: "rslt", scope: !673, file: !77, line: 1530, type: !62)
!677 = !DILocation(line: 1530, column: 9, scope: !673)
!678 = !DILocation(line: 1529, column: 3, scope: !673)
!679 = !DILocation(line: 1533, column: 11, scope: !680)
!680 = distinct !DILexicalBlock(scope: !673, file: !77, line: 1533, column: 6)
!681 = !DILocation(line: 1533, column: 20, scope: !680)
!682 = !DILocation(line: 1533, column: 29, scope: !683)
!683 = !DILexicalBlockFile(scope: !680, file: !77, discriminator: 1)
!684 = !DILocation(line: 1533, column: 38, scope: !683)
!685 = !DILocation(line: 1533, column: 6, scope: !686)
!686 = !DILexicalBlockFile(scope: !673, file: !77, discriminator: 1)
!687 = !DILocation(line: 1534, column: 8, scope: !688)
!688 = distinct !DILexicalBlock(scope: !680, file: !77, line: 1533, column: 48)
!689 = !DILocation(line: 1535, column: 2, scope: !688)
!690 = !DILocation(line: 1536, column: 10, scope: !691)
!691 = distinct !DILexicalBlock(scope: !680, file: !77, line: 1535, column: 9)
!692 = !DILocation(line: 1536, column: 8, scope: !691)
!693 = !DILocation(line: 1537, column: 7, scope: !694)
!694 = distinct !DILexicalBlock(scope: !691, file: !77, line: 1537, column: 7)
!695 = !DILocation(line: 1537, column: 12, scope: !694)
!696 = !DILocation(line: 1537, column: 7, scope: !691)
!697 = !DILocation(line: 1538, column: 11, scope: !694)
!698 = !DILocation(line: 1538, column: 9, scope: !694)
!699 = !DILocation(line: 1538, column: 4, scope: !694)
!700 = !DILocation(line: 1541, column: 2, scope: !673)
!701 = distinct !DISubprogram(name: "check_invalid_settg", scope: !77, file: !77, line: 2943, type: !412, isLocal: true, isDefinition: true, scopeLine: 2944, flags: DIFlagPrototyped, isOptimized: false, unit: !76, variables: !175)
!702 = !DILocalVariable(name: "dev", arg: 1, scope: !701, file: !77, line: 2943, type: !252)
!703 = !DILocation(line: 2943, column: 60, scope: !701)
!704 = !DILocalVariable(name: "rslt", scope: !701, file: !77, line: 2945, type: !62)
!705 = !DILocation(line: 2945, column: 9, scope: !701)
!706 = !DILocation(line: 2944, column: 3, scope: !701)
!707 = !DILocalVariable(name: "data", scope: !701, file: !77, line: 2946, type: !17)
!708 = !DILocation(line: 2946, column: 10, scope: !701)
!709 = !DILocation(line: 2949, column: 9, scope: !701)
!710 = !DILocation(line: 2949, column: 7, scope: !701)
!711 = !DILocation(line: 2951, column: 9, scope: !701)
!712 = !DILocation(line: 2951, column: 14, scope: !701)
!713 = !DILocation(line: 2951, column: 7, scope: !701)
!714 = !DILocation(line: 2952, column: 9, scope: !701)
!715 = !DILocation(line: 2952, column: 14, scope: !701)
!716 = !DILocation(line: 2952, column: 7, scope: !701)
!717 = !DILocation(line: 2953, column: 6, scope: !718)
!718 = distinct !DILexicalBlock(scope: !701, file: !77, line: 2953, column: 6)
!719 = !DILocation(line: 2953, column: 11, scope: !718)
!720 = !DILocation(line: 2953, column: 6, scope: !701)
!721 = !DILocation(line: 2954, column: 8, scope: !718)
!722 = !DILocation(line: 2954, column: 3, scope: !718)
!723 = !DILocation(line: 2955, column: 11, scope: !724)
!724 = distinct !DILexicalBlock(scope: !718, file: !77, line: 2955, column: 11)
!725 = !DILocation(line: 2955, column: 16, scope: !724)
!726 = !DILocation(line: 2955, column: 11, scope: !718)
!727 = !DILocation(line: 2956, column: 8, scope: !724)
!728 = !DILocation(line: 2956, column: 3, scope: !724)
!729 = !DILocation(line: 2957, column: 11, scope: !730)
!730 = distinct !DILexicalBlock(scope: !724, file: !77, line: 2957, column: 11)
!731 = !DILocation(line: 2957, column: 16, scope: !730)
!732 = !DILocation(line: 2957, column: 11, scope: !724)
!733 = !DILocation(line: 2958, column: 8, scope: !730)
!734 = !DILocation(line: 2958, column: 3, scope: !730)
!735 = !DILocation(line: 2959, column: 11, scope: !736)
!736 = distinct !DILexicalBlock(scope: !730, file: !77, line: 2959, column: 11)
!737 = !DILocation(line: 2959, column: 16, scope: !736)
!738 = !DILocation(line: 2959, column: 11, scope: !730)
!739 = !DILocation(line: 2960, column: 8, scope: !736)
!740 = !DILocation(line: 2960, column: 3, scope: !736)
!741 = !DILocation(line: 2962, column: 2, scope: !701)
!742 = distinct !DISubprogram(name: "set_accel_pwr", scope: !77, file: !77, line: 3080, type: !339, isLocal: true, isDefinition: true, scopeLine: 3081, flags: DIFlagPrototyped, isOptimized: false, unit: !76, variables: !175)
!743 = !DILocalVariable(name: "dev", arg: 1, scope: !742, file: !77, line: 3080, type: !341)
!744 = !DILocation(line: 3080, column: 48, scope: !742)
!745 = !DILocalVariable(name: "rslt", scope: !742, file: !77, line: 3082, type: !62)
!746 = !DILocation(line: 3082, column: 9, scope: !742)
!747 = !DILocation(line: 3081, column: 3, scope: !742)
!748 = !DILocalVariable(name: "data", scope: !742, file: !77, line: 3083, type: !17)
!749 = !DILocation(line: 3083, column: 10, scope: !742)
!750 = !DILocation(line: 3085, column: 12, scope: !751)
!751 = distinct !DILexicalBlock(scope: !742, file: !77, line: 3085, column: 6)
!752 = !DILocation(line: 3085, column: 22, scope: !751)
!753 = !DILocation(line: 3085, column: 7, scope: !751)
!754 = !DILocation(line: 3085, column: 28, scope: !751)
!755 = !DILocation(line: 3085, column: 58, scope: !751)
!756 = !DILocation(line: 3086, column: 9, scope: !751)
!757 = !DILocation(line: 3086, column: 19, scope: !751)
!758 = !DILocation(line: 3086, column: 4, scope: !751)
!759 = !DILocation(line: 3086, column: 25, scope: !751)
!760 = !DILocation(line: 3085, column: 6, scope: !761)
!761 = !DILexicalBlockFile(scope: !742, file: !77, discriminator: 1)
!762 = !DILocation(line: 3087, column: 12, scope: !763)
!763 = distinct !DILexicalBlock(scope: !764, file: !77, line: 3087, column: 7)
!764 = distinct !DILexicalBlock(scope: !751, file: !77, line: 3086, column: 57)
!765 = !DILocation(line: 3087, column: 22, scope: !763)
!766 = !DILocation(line: 3087, column: 7, scope: !763)
!767 = !DILocation(line: 3087, column: 36, scope: !763)
!768 = !DILocation(line: 3087, column: 51, scope: !763)
!769 = !DILocation(line: 3087, column: 31, scope: !763)
!770 = !DILocation(line: 3087, column: 28, scope: !763)
!771 = !DILocation(line: 3087, column: 7, scope: !764)
!772 = !DILocation(line: 3088, column: 11, scope: !773)
!773 = distinct !DILexicalBlock(scope: !763, file: !77, line: 3087, column: 58)
!774 = !DILocation(line: 3088, column: 9, scope: !773)
!775 = !DILocation(line: 3089, column: 8, scope: !776)
!776 = distinct !DILexicalBlock(scope: !773, file: !77, line: 3089, column: 8)
!777 = !DILocation(line: 3089, column: 13, scope: !776)
!778 = !DILocation(line: 3089, column: 8, scope: !773)
!779 = !DILocation(line: 3091, column: 59, scope: !780)
!780 = distinct !DILexicalBlock(scope: !776, file: !77, line: 3089, column: 27)
!781 = !DILocation(line: 3091, column: 69, scope: !780)
!782 = !DILocation(line: 3091, column: 12, scope: !780)
!783 = !DILocation(line: 3091, column: 10, scope: !780)
!784 = !DILocation(line: 3093, column: 14, scope: !785)
!785 = distinct !DILexicalBlock(scope: !780, file: !77, line: 3093, column: 9)
!786 = !DILocation(line: 3093, column: 29, scope: !785)
!787 = !DILocation(line: 3093, column: 9, scope: !785)
!788 = !DILocation(line: 3093, column: 35, scope: !785)
!789 = !DILocation(line: 3093, column: 9, scope: !780)
!790 = !DILocation(line: 3094, column: 11, scope: !785)
!791 = !DILocation(line: 3094, column: 6, scope: !785)
!792 = !DILocation(line: 3095, column: 38, scope: !780)
!793 = !DILocation(line: 3095, column: 48, scope: !780)
!794 = !DILocation(line: 3095, column: 10, scope: !780)
!795 = !DILocation(line: 3095, column: 25, scope: !780)
!796 = !DILocation(line: 3095, column: 31, scope: !780)
!797 = !DILocation(line: 3096, column: 4, scope: !780)
!798 = !DILocation(line: 3097, column: 3, scope: !773)
!799 = !DILocation(line: 3098, column: 2, scope: !764)
!800 = !DILocation(line: 3099, column: 8, scope: !801)
!801 = distinct !DILexicalBlock(scope: !751, file: !77, line: 3098, column: 9)
!802 = !DILocation(line: 3102, column: 2, scope: !742)
!803 = distinct !DISubprogram(name: "set_gyro_pwr", scope: !77, file: !77, line: 3146, type: !339, isLocal: true, isDefinition: true, scopeLine: 3147, flags: DIFlagPrototyped, isOptimized: false, unit: !76, variables: !175)
!804 = !DILocalVariable(name: "dev", arg: 1, scope: !803, file: !77, line: 3146, type: !341)
!805 = !DILocation(line: 3146, column: 47, scope: !803)
!806 = !DILocalVariable(name: "rslt", scope: !803, file: !77, line: 3148, type: !62)
!807 = !DILocation(line: 3148, column: 9, scope: !803)
!808 = !DILocation(line: 3147, column: 3, scope: !803)
!809 = !DILocation(line: 3150, column: 12, scope: !810)
!810 = distinct !DILexicalBlock(scope: !803, file: !77, line: 3150, column: 6)
!811 = !DILocation(line: 3150, column: 21, scope: !810)
!812 = !DILocation(line: 3150, column: 7, scope: !810)
!813 = !DILocation(line: 3150, column: 27, scope: !810)
!814 = !DILocation(line: 3150, column: 56, scope: !810)
!815 = !DILocation(line: 3150, column: 65, scope: !816)
!816 = !DILexicalBlockFile(scope: !810, file: !77, discriminator: 1)
!817 = !DILocation(line: 3150, column: 74, scope: !816)
!818 = !DILocation(line: 3150, column: 60, scope: !816)
!819 = !DILocation(line: 3150, column: 80, scope: !816)
!820 = !DILocation(line: 3151, column: 3, scope: !810)
!821 = !DILocation(line: 3151, column: 12, scope: !816)
!822 = !DILocation(line: 3151, column: 21, scope: !816)
!823 = !DILocation(line: 3151, column: 7, scope: !816)
!824 = !DILocation(line: 3151, column: 27, scope: !816)
!825 = !DILocation(line: 3150, column: 6, scope: !826)
!826 = !DILexicalBlockFile(scope: !803, file: !77, discriminator: 2)
!827 = !DILocation(line: 3153, column: 12, scope: !828)
!828 = distinct !DILexicalBlock(scope: !829, file: !77, line: 3153, column: 7)
!829 = distinct !DILexicalBlock(scope: !810, file: !77, line: 3151, column: 61)
!830 = !DILocation(line: 3153, column: 21, scope: !828)
!831 = !DILocation(line: 3153, column: 7, scope: !828)
!832 = !DILocation(line: 3153, column: 35, scope: !828)
!833 = !DILocation(line: 3153, column: 49, scope: !828)
!834 = !DILocation(line: 3153, column: 30, scope: !828)
!835 = !DILocation(line: 3153, column: 27, scope: !828)
!836 = !DILocation(line: 3153, column: 7, scope: !829)
!837 = !DILocation(line: 3156, column: 58, scope: !838)
!838 = distinct !DILexicalBlock(scope: !828, file: !77, line: 3153, column: 56)
!839 = !DILocation(line: 3156, column: 67, scope: !838)
!840 = !DILocation(line: 3156, column: 11, scope: !838)
!841 = !DILocation(line: 3156, column: 9, scope: !838)
!842 = !DILocation(line: 3157, column: 13, scope: !843)
!843 = distinct !DILexicalBlock(scope: !838, file: !77, line: 3157, column: 8)
!844 = !DILocation(line: 3157, column: 27, scope: !843)
!845 = !DILocation(line: 3157, column: 8, scope: !843)
!846 = !DILocation(line: 3157, column: 33, scope: !843)
!847 = !DILocation(line: 3157, column: 8, scope: !838)
!848 = !DILocation(line: 3160, column: 10, scope: !849)
!849 = distinct !DILexicalBlock(scope: !843, file: !77, line: 3158, column: 31)
!850 = !DILocation(line: 3160, column: 5, scope: !849)
!851 = !DILocation(line: 3161, column: 4, scope: !849)
!852 = !DILocation(line: 3161, column: 21, scope: !853)
!853 = !DILexicalBlockFile(scope: !854, file: !77, discriminator: 1)
!854 = distinct !DILexicalBlock(scope: !843, file: !77, line: 3161, column: 15)
!855 = !DILocation(line: 3161, column: 35, scope: !853)
!856 = !DILocation(line: 3161, column: 16, scope: !853)
!857 = !DILocation(line: 3161, column: 41, scope: !853)
!858 = !DILocation(line: 3162, column: 5, scope: !854)
!859 = !DILocation(line: 3162, column: 14, scope: !853)
!860 = !DILocation(line: 3162, column: 23, scope: !853)
!861 = !DILocation(line: 3162, column: 9, scope: !853)
!862 = !DILocation(line: 3162, column: 29, scope: !853)
!863 = !DILocation(line: 3161, column: 15, scope: !864)
!864 = !DILexicalBlockFile(scope: !843, file: !77, discriminator: 2)
!865 = !DILocation(line: 3165, column: 10, scope: !866)
!866 = distinct !DILexicalBlock(scope: !854, file: !77, line: 3162, column: 58)
!867 = !DILocation(line: 3165, column: 5, scope: !866)
!868 = !DILocation(line: 3166, column: 4, scope: !866)
!869 = !DILocation(line: 3169, column: 36, scope: !838)
!870 = !DILocation(line: 3169, column: 45, scope: !838)
!871 = !DILocation(line: 3169, column: 9, scope: !838)
!872 = !DILocation(line: 3169, column: 23, scope: !838)
!873 = !DILocation(line: 3169, column: 29, scope: !838)
!874 = !DILocation(line: 3170, column: 3, scope: !838)
!875 = !DILocation(line: 3171, column: 2, scope: !829)
!876 = !DILocation(line: 3172, column: 8, scope: !877)
!877 = distinct !DILexicalBlock(scope: !810, file: !77, line: 3171, column: 9)
!878 = !DILocation(line: 3175, column: 2, scope: !803)
!879 = distinct !DISubprogram(name: "process_under_sampling", scope: !77, file: !77, line: 3108, type: !880, isLocal: true, isDefinition: true, scopeLine: 3109, flags: DIFlagPrototyped, isOptimized: false, unit: !76, variables: !175)
!880 = !DISubroutineType(types: !881)
!881 = !{!62, !45, !252}
!882 = !DILocalVariable(name: "data", arg: 1, scope: !879, file: !77, line: 3108, type: !45)
!883 = !DILocation(line: 3108, column: 47, scope: !879)
!884 = !DILocalVariable(name: "dev", arg: 2, scope: !879, file: !77, line: 3108, type: !252)
!885 = !DILocation(line: 3108, column: 78, scope: !879)
!886 = !DILocalVariable(name: "rslt", scope: !879, file: !77, line: 3110, type: !62)
!887 = !DILocation(line: 3110, column: 9, scope: !879)
!888 = !DILocalVariable(name: "temp", scope: !879, file: !77, line: 3111, type: !17)
!889 = !DILocation(line: 3111, column: 10, scope: !879)
!890 = !DILocation(line: 3109, column: 3, scope: !879)
!891 = !DILocalVariable(name: "pre_filter", scope: !879, file: !77, line: 3112, type: !17)
!892 = !DILocation(line: 3112, column: 10, scope: !879)
!893 = !DILocation(line: 3114, column: 9, scope: !879)
!894 = !DILocation(line: 3114, column: 7, scope: !879)
!895 = !DILocation(line: 3115, column: 6, scope: !896)
!896 = distinct !DILexicalBlock(scope: !879, file: !77, line: 3115, column: 6)
!897 = !DILocation(line: 3115, column: 11, scope: !896)
!898 = !DILocation(line: 3115, column: 6, scope: !879)
!899 = !DILocation(line: 3116, column: 12, scope: !900)
!900 = distinct !DILexicalBlock(scope: !901, file: !77, line: 3116, column: 7)
!901 = distinct !DILexicalBlock(scope: !896, file: !77, line: 3115, column: 25)
!902 = !DILocation(line: 3116, column: 22, scope: !900)
!903 = !DILocation(line: 3116, column: 7, scope: !900)
!904 = !DILocation(line: 3116, column: 28, scope: !900)
!905 = !DILocation(line: 3116, column: 7, scope: !901)
!906 = !DILocation(line: 3117, column: 11, scope: !907)
!907 = distinct !DILexicalBlock(scope: !900, file: !77, line: 3116, column: 59)
!908 = !DILocation(line: 3117, column: 17, scope: !907)
!909 = !DILocation(line: 3117, column: 9, scope: !907)
!910 = !DILocation(line: 3119, column: 12, scope: !907)
!911 = !DILocation(line: 3119, column: 17, scope: !907)
!912 = !DILocation(line: 3119, column: 10, scope: !907)
!913 = !DILocation(line: 3121, column: 11, scope: !907)
!914 = !DILocation(line: 3121, column: 9, scope: !907)
!915 = !DILocation(line: 3124, column: 8, scope: !916)
!916 = distinct !DILexicalBlock(scope: !907, file: !77, line: 3124, column: 8)
!917 = !DILocation(line: 3124, column: 13, scope: !916)
!918 = !DILocation(line: 3124, column: 8, scope: !907)
!919 = !DILocation(line: 3126, column: 12, scope: !916)
!920 = !DILocation(line: 3126, column: 10, scope: !916)
!921 = !DILocation(line: 3126, column: 5, scope: !916)
!922 = !DILocation(line: 3127, column: 3, scope: !907)
!923 = !DILocation(line: 3128, column: 8, scope: !924)
!924 = distinct !DILexicalBlock(scope: !925, file: !77, line: 3128, column: 8)
!925 = distinct !DILexicalBlock(scope: !900, file: !77, line: 3127, column: 10)
!926 = !DILocation(line: 3128, column: 14, scope: !924)
!927 = !DILocation(line: 3128, column: 8, scope: !925)
!928 = !DILocation(line: 3130, column: 12, scope: !929)
!929 = distinct !DILexicalBlock(scope: !924, file: !77, line: 3128, column: 49)
!930 = !DILocation(line: 3130, column: 18, scope: !929)
!931 = !DILocation(line: 3130, column: 10, scope: !929)
!932 = !DILocation(line: 3133, column: 11, scope: !929)
!933 = !DILocation(line: 3135, column: 12, scope: !929)
!934 = !DILocation(line: 3135, column: 10, scope: !929)
!935 = !DILocation(line: 3136, column: 4, scope: !929)
!936 = !DILocation(line: 3138, column: 2, scope: !901)
!937 = !DILocation(line: 3140, column: 2, scope: !879)
!938 = distinct !DISubprogram(name: "check_gyro_config", scope: !77, file: !77, line: 2991, type: !880, isLocal: true, isDefinition: true, scopeLine: 2992, flags: DIFlagPrototyped, isOptimized: false, unit: !76, variables: !175)
!939 = !DILocalVariable(name: "data", arg: 1, scope: !938, file: !77, line: 2991, type: !45)
!940 = !DILocation(line: 2991, column: 42, scope: !938)
!941 = !DILocalVariable(name: "dev", arg: 2, scope: !938, file: !77, line: 2991, type: !252)
!942 = !DILocation(line: 2991, column: 73, scope: !938)
!943 = !DILocalVariable(name: "rslt", scope: !938, file: !77, line: 2993, type: !62)
!944 = !DILocation(line: 2993, column: 9, scope: !938)
!945 = !DILocation(line: 2992, column: 3, scope: !938)
!946 = !DILocation(line: 2996, column: 9, scope: !938)
!947 = !DILocation(line: 2996, column: 7, scope: !938)
!948 = !DILocation(line: 2997, column: 6, scope: !949)
!949 = distinct !DILexicalBlock(scope: !938, file: !77, line: 2997, column: 6)
!950 = !DILocation(line: 2997, column: 11, scope: !949)
!951 = !DILocation(line: 2997, column: 6, scope: !938)
!952 = !DILocation(line: 2998, column: 28, scope: !953)
!953 = distinct !DILexicalBlock(scope: !949, file: !77, line: 2997, column: 25)
!954 = !DILocation(line: 2998, column: 10, scope: !953)
!955 = !DILocation(line: 2998, column: 8, scope: !953)
!956 = !DILocation(line: 2999, column: 7, scope: !957)
!957 = distinct !DILexicalBlock(scope: !953, file: !77, line: 2999, column: 7)
!958 = !DILocation(line: 2999, column: 12, scope: !957)
!959 = !DILocation(line: 2999, column: 7, scope: !953)
!960 = !DILocation(line: 3000, column: 28, scope: !961)
!961 = distinct !DILexicalBlock(scope: !957, file: !77, line: 2999, column: 26)
!962 = !DILocation(line: 3000, column: 11, scope: !961)
!963 = !DILocation(line: 3000, column: 9, scope: !961)
!964 = !DILocation(line: 3001, column: 8, scope: !965)
!965 = distinct !DILexicalBlock(scope: !961, file: !77, line: 3001, column: 8)
!966 = !DILocation(line: 3001, column: 13, scope: !965)
!967 = !DILocation(line: 3001, column: 8, scope: !961)
!968 = !DILocation(line: 3002, column: 32, scope: !965)
!969 = !DILocation(line: 3002, column: 12, scope: !965)
!970 = !DILocation(line: 3002, column: 10, scope: !965)
!971 = !DILocation(line: 3002, column: 5, scope: !965)
!972 = !DILocation(line: 3003, column: 3, scope: !961)
!973 = !DILocation(line: 3004, column: 2, scope: !953)
!974 = !DILocation(line: 3006, column: 2, scope: !938)
!975 = distinct !DISubprogram(name: "process_gyro_odr", scope: !77, file: !77, line: 3013, type: !880, isLocal: true, isDefinition: true, scopeLine: 3014, flags: DIFlagPrototyped, isOptimized: false, unit: !76, variables: !175)
!976 = !DILocalVariable(name: "data", arg: 1, scope: !975, file: !77, line: 3013, type: !45)
!977 = !DILocation(line: 3013, column: 41, scope: !975)
!978 = !DILocalVariable(name: "dev", arg: 2, scope: !975, file: !77, line: 3013, type: !252)
!979 = !DILocation(line: 3013, column: 72, scope: !975)
!980 = !DILocalVariable(name: "rslt", scope: !975, file: !77, line: 3015, type: !62)
!981 = !DILocation(line: 3015, column: 9, scope: !975)
!982 = !DILocalVariable(name: "temp", scope: !975, file: !77, line: 3016, type: !17)
!983 = !DILocation(line: 3016, column: 10, scope: !975)
!984 = !DILocalVariable(name: "odr", scope: !975, file: !77, line: 3017, type: !17)
!985 = !DILocation(line: 3017, column: 10, scope: !975)
!986 = !DILocation(line: 3014, column: 3, scope: !975)
!987 = !DILocation(line: 3019, column: 11, scope: !988)
!988 = distinct !DILexicalBlock(scope: !975, file: !77, line: 3019, column: 6)
!989 = !DILocation(line: 3019, column: 20, scope: !988)
!990 = !DILocation(line: 3019, column: 6, scope: !988)
!991 = !DILocation(line: 3019, column: 24, scope: !988)
!992 = !DILocation(line: 3019, column: 6, scope: !975)
!993 = !DILocation(line: 3020, column: 12, scope: !994)
!994 = distinct !DILexicalBlock(scope: !995, file: !77, line: 3020, column: 7)
!995 = distinct !DILexicalBlock(scope: !988, file: !77, line: 3019, column: 48)
!996 = !DILocation(line: 3020, column: 21, scope: !994)
!997 = !DILocation(line: 3020, column: 7, scope: !994)
!998 = !DILocation(line: 3020, column: 33, scope: !994)
!999 = !DILocation(line: 3020, column: 47, scope: !994)
!1000 = !DILocation(line: 3020, column: 28, scope: !994)
!1001 = !DILocation(line: 3020, column: 25, scope: !994)
!1002 = !DILocation(line: 3020, column: 7, scope: !995)
!1003 = !DILocation(line: 3021, column: 24, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !994, file: !77, line: 3020, column: 52)
!1005 = !DILocation(line: 3021, column: 33, scope: !1004)
!1006 = !DILocation(line: 3021, column: 8, scope: !1004)
!1007 = !DILocation(line: 3022, column: 12, scope: !1004)
!1008 = !DILocation(line: 3022, column: 18, scope: !1004)
!1009 = !DILocation(line: 3022, column: 11, scope: !1004)
!1010 = !DILocation(line: 3022, column: 9, scope: !1004)
!1011 = !DILocation(line: 3024, column: 12, scope: !1004)
!1012 = !DILocation(line: 3024, column: 20, scope: !1004)
!1013 = !DILocation(line: 3024, column: 24, scope: !1004)
!1014 = !DILocation(line: 3024, column: 17, scope: !1004)
!1015 = !DILocation(line: 3024, column: 10, scope: !1004)
!1016 = !DILocation(line: 3025, column: 3, scope: !1004)
!1017 = !DILocation(line: 3026, column: 2, scope: !995)
!1018 = !DILocation(line: 3027, column: 8, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !988, file: !77, line: 3026, column: 9)
!1020 = !DILocation(line: 3030, column: 2, scope: !975)
!1021 = distinct !DISubprogram(name: "process_gyro_bw", scope: !77, file: !77, line: 3036, type: !880, isLocal: true, isDefinition: true, scopeLine: 3037, flags: DIFlagPrototyped, isOptimized: false, unit: !76, variables: !175)
!1022 = !DILocalVariable(name: "data", arg: 1, scope: !1021, file: !77, line: 3036, type: !45)
!1023 = !DILocation(line: 3036, column: 40, scope: !1021)
!1024 = !DILocalVariable(name: "dev", arg: 2, scope: !1021, file: !77, line: 3036, type: !252)
!1025 = !DILocation(line: 3036, column: 71, scope: !1021)
!1026 = !DILocalVariable(name: "rslt", scope: !1021, file: !77, line: 3038, type: !62)
!1027 = !DILocation(line: 3038, column: 9, scope: !1021)
!1028 = !DILocalVariable(name: "temp", scope: !1021, file: !77, line: 3039, type: !17)
!1029 = !DILocation(line: 3039, column: 10, scope: !1021)
!1030 = !DILocalVariable(name: "bw", scope: !1021, file: !77, line: 3040, type: !17)
!1031 = !DILocation(line: 3040, column: 10, scope: !1021)
!1032 = !DILocation(line: 3037, column: 3, scope: !1021)
!1033 = !DILocation(line: 3042, column: 11, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !1021, file: !77, line: 3042, column: 6)
!1035 = !DILocation(line: 3042, column: 20, scope: !1034)
!1036 = !DILocation(line: 3042, column: 6, scope: !1034)
!1037 = !DILocation(line: 3042, column: 23, scope: !1034)
!1038 = !DILocation(line: 3042, column: 6, scope: !1021)
!1039 = !DILocation(line: 3043, column: 22, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !1034, file: !77, line: 3042, column: 46)
!1041 = !DILocation(line: 3043, column: 31, scope: !1040)
!1042 = !DILocation(line: 3043, column: 6, scope: !1040)
!1043 = !DILocation(line: 3044, column: 10, scope: !1040)
!1044 = !DILocation(line: 3044, column: 16, scope: !1040)
!1045 = !DILocation(line: 3044, column: 8, scope: !1040)
!1046 = !DILocation(line: 3046, column: 11, scope: !1040)
!1047 = !DILocation(line: 3046, column: 20, scope: !1040)
!1048 = !DILocation(line: 3046, column: 23, scope: !1040)
!1049 = !DILocation(line: 3046, column: 29, scope: !1040)
!1050 = !DILocation(line: 3046, column: 16, scope: !1040)
!1051 = !DILocation(line: 3046, column: 9, scope: !1040)
!1052 = !DILocation(line: 3047, column: 2, scope: !1040)
!1053 = !DILocation(line: 3048, column: 8, scope: !1054)
!1054 = distinct !DILexicalBlock(scope: !1034, file: !77, line: 3047, column: 9)
!1055 = !DILocation(line: 3051, column: 2, scope: !1021)
!1056 = distinct !DISubprogram(name: "process_gyro_range", scope: !77, file: !77, line: 3057, type: !880, isLocal: true, isDefinition: true, scopeLine: 3058, flags: DIFlagPrototyped, isOptimized: false, unit: !76, variables: !175)
!1057 = !DILocalVariable(name: "data", arg: 1, scope: !1056, file: !77, line: 3057, type: !45)
!1058 = !DILocation(line: 3057, column: 43, scope: !1056)
!1059 = !DILocalVariable(name: "dev", arg: 2, scope: !1056, file: !77, line: 3057, type: !252)
!1060 = !DILocation(line: 3057, column: 74, scope: !1056)
!1061 = !DILocalVariable(name: "rslt", scope: !1056, file: !77, line: 3059, type: !62)
!1062 = !DILocation(line: 3059, column: 9, scope: !1056)
!1063 = !DILocalVariable(name: "temp", scope: !1056, file: !77, line: 3060, type: !17)
!1064 = !DILocation(line: 3060, column: 10, scope: !1056)
!1065 = !DILocalVariable(name: "range", scope: !1056, file: !77, line: 3061, type: !17)
!1066 = !DILocation(line: 3061, column: 10, scope: !1056)
!1067 = !DILocation(line: 3058, column: 3, scope: !1056)
!1068 = !DILocation(line: 3063, column: 11, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1056, file: !77, line: 3063, column: 6)
!1070 = !DILocation(line: 3063, column: 20, scope: !1069)
!1071 = !DILocation(line: 3063, column: 6, scope: !1069)
!1072 = !DILocation(line: 3063, column: 26, scope: !1069)
!1073 = !DILocation(line: 3063, column: 6, scope: !1056)
!1074 = !DILocation(line: 3064, column: 12, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !1076, file: !77, line: 3064, column: 7)
!1076 = distinct !DILexicalBlock(scope: !1069, file: !77, line: 3063, column: 52)
!1077 = !DILocation(line: 3064, column: 21, scope: !1075)
!1078 = !DILocation(line: 3064, column: 7, scope: !1075)
!1079 = !DILocation(line: 3064, column: 35, scope: !1075)
!1080 = !DILocation(line: 3064, column: 49, scope: !1075)
!1081 = !DILocation(line: 3064, column: 30, scope: !1075)
!1082 = !DILocation(line: 3064, column: 27, scope: !1075)
!1083 = !DILocation(line: 3064, column: 7, scope: !1076)
!1084 = !DILocation(line: 3065, column: 26, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1075, file: !77, line: 3064, column: 56)
!1086 = !DILocation(line: 3065, column: 35, scope: !1085)
!1087 = !DILocation(line: 3065, column: 10, scope: !1085)
!1088 = !DILocation(line: 3066, column: 11, scope: !1085)
!1089 = !DILocation(line: 3066, column: 17, scope: !1085)
!1090 = !DILocation(line: 3066, column: 9, scope: !1085)
!1091 = !DILocation(line: 3068, column: 12, scope: !1085)
!1092 = !DILocation(line: 3068, column: 20, scope: !1085)
!1093 = !DILocation(line: 3068, column: 26, scope: !1085)
!1094 = !DILocation(line: 3068, column: 17, scope: !1085)
!1095 = !DILocation(line: 3068, column: 10, scope: !1085)
!1096 = !DILocation(line: 3069, column: 3, scope: !1085)
!1097 = !DILocation(line: 3070, column: 2, scope: !1076)
!1098 = !DILocation(line: 3071, column: 8, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !1069, file: !77, line: 3070, column: 9)
!1100 = !DILocation(line: 3074, column: 2, scope: !1056)
!1101 = distinct !DISubprogram(name: "check_accel_config", scope: !77, file: !77, line: 2852, type: !880, isLocal: true, isDefinition: true, scopeLine: 2853, flags: DIFlagPrototyped, isOptimized: false, unit: !76, variables: !175)
!1102 = !DILocalVariable(name: "data", arg: 1, scope: !1101, file: !77, line: 2852, type: !45)
!1103 = !DILocation(line: 2852, column: 43, scope: !1101)
!1104 = !DILocalVariable(name: "dev", arg: 2, scope: !1101, file: !77, line: 2852, type: !252)
!1105 = !DILocation(line: 2852, column: 74, scope: !1101)
!1106 = !DILocalVariable(name: "rslt", scope: !1101, file: !77, line: 2854, type: !62)
!1107 = !DILocation(line: 2854, column: 9, scope: !1101)
!1108 = !DILocation(line: 2853, column: 3, scope: !1101)
!1109 = !DILocation(line: 2857, column: 9, scope: !1101)
!1110 = !DILocation(line: 2857, column: 7, scope: !1101)
!1111 = !DILocation(line: 2858, column: 6, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1101, file: !77, line: 2858, column: 6)
!1113 = !DILocation(line: 2858, column: 11, scope: !1112)
!1114 = !DILocation(line: 2858, column: 6, scope: !1101)
!1115 = !DILocation(line: 2859, column: 29, scope: !1116)
!1116 = distinct !DILexicalBlock(scope: !1112, file: !77, line: 2858, column: 25)
!1117 = !DILocation(line: 2859, column: 10, scope: !1116)
!1118 = !DILocation(line: 2859, column: 8, scope: !1116)
!1119 = !DILocation(line: 2860, column: 7, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !1116, file: !77, line: 2860, column: 7)
!1121 = !DILocation(line: 2860, column: 12, scope: !1120)
!1122 = !DILocation(line: 2860, column: 7, scope: !1116)
!1123 = !DILocation(line: 2861, column: 29, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1120, file: !77, line: 2860, column: 26)
!1125 = !DILocation(line: 2861, column: 11, scope: !1124)
!1126 = !DILocation(line: 2861, column: 9, scope: !1124)
!1127 = !DILocation(line: 2862, column: 8, scope: !1128)
!1128 = distinct !DILexicalBlock(scope: !1124, file: !77, line: 2862, column: 8)
!1129 = !DILocation(line: 2862, column: 13, scope: !1128)
!1130 = !DILocation(line: 2862, column: 8, scope: !1124)
!1131 = !DILocation(line: 2863, column: 33, scope: !1128)
!1132 = !DILocation(line: 2863, column: 12, scope: !1128)
!1133 = !DILocation(line: 2863, column: 10, scope: !1128)
!1134 = !DILocation(line: 2863, column: 5, scope: !1128)
!1135 = !DILocation(line: 2864, column: 3, scope: !1124)
!1136 = !DILocation(line: 2865, column: 2, scope: !1116)
!1137 = !DILocation(line: 2867, column: 2, scope: !1101)
!1138 = distinct !DISubprogram(name: "process_accel_odr", scope: !77, file: !77, line: 2873, type: !880, isLocal: true, isDefinition: true, scopeLine: 2874, flags: DIFlagPrototyped, isOptimized: false, unit: !76, variables: !175)
!1139 = !DILocalVariable(name: "data", arg: 1, scope: !1138, file: !77, line: 2873, type: !45)
!1140 = !DILocation(line: 2873, column: 42, scope: !1138)
!1141 = !DILocalVariable(name: "dev", arg: 2, scope: !1138, file: !77, line: 2873, type: !252)
!1142 = !DILocation(line: 2873, column: 73, scope: !1138)
!1143 = !DILocalVariable(name: "rslt", scope: !1138, file: !77, line: 2875, type: !62)
!1144 = !DILocation(line: 2875, column: 9, scope: !1138)
!1145 = !DILocalVariable(name: "temp", scope: !1138, file: !77, line: 2876, type: !17)
!1146 = !DILocation(line: 2876, column: 10, scope: !1138)
!1147 = !DILocalVariable(name: "odr", scope: !1138, file: !77, line: 2877, type: !17)
!1148 = !DILocation(line: 2877, column: 10, scope: !1138)
!1149 = !DILocation(line: 2874, column: 3, scope: !1138)
!1150 = !DILocation(line: 2879, column: 11, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !1138, file: !77, line: 2879, column: 6)
!1152 = !DILocation(line: 2879, column: 21, scope: !1151)
!1153 = !DILocation(line: 2879, column: 6, scope: !1151)
!1154 = !DILocation(line: 2879, column: 25, scope: !1151)
!1155 = !DILocation(line: 2879, column: 6, scope: !1138)
!1156 = !DILocation(line: 2880, column: 12, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1158, file: !77, line: 2880, column: 7)
!1158 = distinct !DILexicalBlock(scope: !1151, file: !77, line: 2879, column: 50)
!1159 = !DILocation(line: 2880, column: 22, scope: !1157)
!1160 = !DILocation(line: 2880, column: 7, scope: !1157)
!1161 = !DILocation(line: 2880, column: 34, scope: !1157)
!1162 = !DILocation(line: 2880, column: 49, scope: !1157)
!1163 = !DILocation(line: 2880, column: 29, scope: !1157)
!1164 = !DILocation(line: 2880, column: 26, scope: !1157)
!1165 = !DILocation(line: 2880, column: 7, scope: !1158)
!1166 = !DILocation(line: 2881, column: 24, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !1157, file: !77, line: 2880, column: 54)
!1168 = !DILocation(line: 2881, column: 34, scope: !1167)
!1169 = !DILocation(line: 2881, column: 8, scope: !1167)
!1170 = !DILocation(line: 2882, column: 11, scope: !1167)
!1171 = !DILocation(line: 2882, column: 17, scope: !1167)
!1172 = !DILocation(line: 2882, column: 9, scope: !1167)
!1173 = !DILocation(line: 2884, column: 12, scope: !1167)
!1174 = !DILocation(line: 2884, column: 20, scope: !1167)
!1175 = !DILocation(line: 2884, column: 24, scope: !1167)
!1176 = !DILocation(line: 2884, column: 17, scope: !1167)
!1177 = !DILocation(line: 2884, column: 10, scope: !1167)
!1178 = !DILocation(line: 2885, column: 3, scope: !1167)
!1179 = !DILocation(line: 2886, column: 2, scope: !1158)
!1180 = !DILocation(line: 2887, column: 8, scope: !1181)
!1181 = distinct !DILexicalBlock(scope: !1151, file: !77, line: 2886, column: 9)
!1182 = !DILocation(line: 2890, column: 2, scope: !1138)
!1183 = distinct !DISubprogram(name: "process_accel_bw", scope: !77, file: !77, line: 2896, type: !880, isLocal: true, isDefinition: true, scopeLine: 2897, flags: DIFlagPrototyped, isOptimized: false, unit: !76, variables: !175)
!1184 = !DILocalVariable(name: "data", arg: 1, scope: !1183, file: !77, line: 2896, type: !45)
!1185 = !DILocation(line: 2896, column: 41, scope: !1183)
!1186 = !DILocalVariable(name: "dev", arg: 2, scope: !1183, file: !77, line: 2896, type: !252)
!1187 = !DILocation(line: 2896, column: 72, scope: !1183)
!1188 = !DILocalVariable(name: "rslt", scope: !1183, file: !77, line: 2898, type: !62)
!1189 = !DILocation(line: 2898, column: 9, scope: !1183)
!1190 = !DILocalVariable(name: "temp", scope: !1183, file: !77, line: 2899, type: !17)
!1191 = !DILocation(line: 2899, column: 10, scope: !1183)
!1192 = !DILocalVariable(name: "bw", scope: !1183, file: !77, line: 2900, type: !17)
!1193 = !DILocation(line: 2900, column: 10, scope: !1183)
!1194 = !DILocation(line: 2897, column: 3, scope: !1183)
!1195 = !DILocation(line: 2902, column: 11, scope: !1196)
!1196 = distinct !DILexicalBlock(scope: !1183, file: !77, line: 2902, column: 6)
!1197 = !DILocation(line: 2902, column: 21, scope: !1196)
!1198 = !DILocation(line: 2902, column: 6, scope: !1196)
!1199 = !DILocation(line: 2902, column: 24, scope: !1196)
!1200 = !DILocation(line: 2902, column: 6, scope: !1183)
!1201 = !DILocation(line: 2903, column: 12, scope: !1202)
!1202 = distinct !DILexicalBlock(scope: !1203, file: !77, line: 2903, column: 7)
!1203 = distinct !DILexicalBlock(scope: !1196, file: !77, line: 2902, column: 48)
!1204 = !DILocation(line: 2903, column: 22, scope: !1202)
!1205 = !DILocation(line: 2903, column: 7, scope: !1202)
!1206 = !DILocation(line: 2903, column: 33, scope: !1202)
!1207 = !DILocation(line: 2903, column: 48, scope: !1202)
!1208 = !DILocation(line: 2903, column: 28, scope: !1202)
!1209 = !DILocation(line: 2903, column: 25, scope: !1202)
!1210 = !DILocation(line: 2903, column: 7, scope: !1203)
!1211 = !DILocation(line: 2904, column: 23, scope: !1212)
!1212 = distinct !DILexicalBlock(scope: !1202, file: !77, line: 2903, column: 52)
!1213 = !DILocation(line: 2904, column: 33, scope: !1212)
!1214 = !DILocation(line: 2904, column: 7, scope: !1212)
!1215 = !DILocation(line: 2905, column: 11, scope: !1212)
!1216 = !DILocation(line: 2905, column: 17, scope: !1212)
!1217 = !DILocation(line: 2905, column: 9, scope: !1212)
!1218 = !DILocation(line: 2907, column: 12, scope: !1212)
!1219 = !DILocation(line: 2907, column: 21, scope: !1212)
!1220 = !DILocation(line: 2907, column: 24, scope: !1212)
!1221 = !DILocation(line: 2907, column: 30, scope: !1212)
!1222 = !DILocation(line: 2907, column: 17, scope: !1212)
!1223 = !DILocation(line: 2907, column: 10, scope: !1212)
!1224 = !DILocation(line: 2908, column: 3, scope: !1212)
!1225 = !DILocation(line: 2909, column: 2, scope: !1203)
!1226 = !DILocation(line: 2910, column: 8, scope: !1227)
!1227 = distinct !DILexicalBlock(scope: !1196, file: !77, line: 2909, column: 9)
!1228 = !DILocation(line: 2913, column: 2, scope: !1183)
!1229 = distinct !DISubprogram(name: "process_accel_range", scope: !77, file: !77, line: 2919, type: !880, isLocal: true, isDefinition: true, scopeLine: 2920, flags: DIFlagPrototyped, isOptimized: false, unit: !76, variables: !175)
!1230 = !DILocalVariable(name: "data", arg: 1, scope: !1229, file: !77, line: 2919, type: !45)
!1231 = !DILocation(line: 2919, column: 44, scope: !1229)
!1232 = !DILocalVariable(name: "dev", arg: 2, scope: !1229, file: !77, line: 2919, type: !252)
!1233 = !DILocation(line: 2919, column: 75, scope: !1229)
!1234 = !DILocalVariable(name: "rslt", scope: !1229, file: !77, line: 2921, type: !62)
!1235 = !DILocation(line: 2921, column: 9, scope: !1229)
!1236 = !DILocalVariable(name: "temp", scope: !1229, file: !77, line: 2922, type: !17)
!1237 = !DILocation(line: 2922, column: 10, scope: !1229)
!1238 = !DILocalVariable(name: "range", scope: !1229, file: !77, line: 2923, type: !17)
!1239 = !DILocation(line: 2923, column: 10, scope: !1229)
!1240 = !DILocation(line: 2920, column: 3, scope: !1229)
!1241 = !DILocation(line: 2925, column: 11, scope: !1242)
!1242 = distinct !DILexicalBlock(scope: !1229, file: !77, line: 2925, column: 6)
!1243 = !DILocation(line: 2925, column: 21, scope: !1242)
!1244 = !DILocation(line: 2925, column: 6, scope: !1242)
!1245 = !DILocation(line: 2925, column: 27, scope: !1242)
!1246 = !DILocation(line: 2925, column: 6, scope: !1229)
!1247 = !DILocation(line: 2926, column: 12, scope: !1248)
!1248 = distinct !DILexicalBlock(scope: !1249, file: !77, line: 2926, column: 7)
!1249 = distinct !DILexicalBlock(scope: !1242, file: !77, line: 2925, column: 54)
!1250 = !DILocation(line: 2926, column: 22, scope: !1248)
!1251 = !DILocation(line: 2926, column: 7, scope: !1248)
!1252 = !DILocation(line: 2926, column: 36, scope: !1248)
!1253 = !DILocation(line: 2926, column: 51, scope: !1248)
!1254 = !DILocation(line: 2926, column: 31, scope: !1248)
!1255 = !DILocation(line: 2926, column: 28, scope: !1248)
!1256 = !DILocation(line: 2926, column: 7, scope: !1249)
!1257 = !DILocation(line: 2927, column: 26, scope: !1258)
!1258 = distinct !DILexicalBlock(scope: !1248, file: !77, line: 2926, column: 58)
!1259 = !DILocation(line: 2927, column: 36, scope: !1258)
!1260 = !DILocation(line: 2927, column: 10, scope: !1258)
!1261 = !DILocation(line: 2928, column: 11, scope: !1258)
!1262 = !DILocation(line: 2928, column: 17, scope: !1258)
!1263 = !DILocation(line: 2928, column: 9, scope: !1258)
!1264 = !DILocation(line: 2930, column: 12, scope: !1258)
!1265 = !DILocation(line: 2930, column: 20, scope: !1258)
!1266 = !DILocation(line: 2930, column: 26, scope: !1258)
!1267 = !DILocation(line: 2930, column: 17, scope: !1258)
!1268 = !DILocation(line: 2930, column: 10, scope: !1258)
!1269 = !DILocation(line: 2931, column: 3, scope: !1258)
!1270 = !DILocation(line: 2932, column: 2, scope: !1249)
!1271 = !DILocation(line: 2933, column: 8, scope: !1272)
!1272 = distinct !DILexicalBlock(scope: !1242, file: !77, line: 2932, column: 9)
!1273 = !DILocation(line: 2936, column: 2, scope: !1229)
!1274 = distinct !DISubprogram(name: "bmi160_get_sensor_data", scope: !77, file: !77, line: 1549, type: !1275, isLocal: false, isDefinition: true, scopeLine: 1551, flags: DIFlagPrototyped, isOptimized: false, unit: !76, variables: !175)
!1275 = !DISubroutineType(types: !1276)
!1276 = !{!62, !17, !1277, !1277, !252}
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64)
!1278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bmi160_sensor_data", file: !6, line: 802, size: 96, elements: !1279)
!1279 = !{!1280, !1281, !1282, !1283}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1278, file: !6, line: 804, baseType: !121, size: 16)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1278, file: !6, line: 806, baseType: !121, size: 16, offset: 16)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !1278, file: !6, line: 808, baseType: !121, size: 16, offset: 32)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "sensortime", scope: !1278, file: !6, line: 810, baseType: !55, size: 32, offset: 64)
!1284 = !DILocalVariable(name: "select_sensor", arg: 1, scope: !1274, file: !77, line: 1549, type: !17)
!1285 = !DILocation(line: 1549, column: 39, scope: !1274)
!1286 = !DILocalVariable(name: "accel", arg: 2, scope: !1274, file: !77, line: 1549, type: !1277)
!1287 = !DILocation(line: 1549, column: 81, scope: !1274)
!1288 = !DILocalVariable(name: "gyro", arg: 3, scope: !1274, file: !77, line: 1549, type: !1277)
!1289 = !DILocation(line: 1549, column: 115, scope: !1274)
!1290 = !DILocalVariable(name: "dev", arg: 4, scope: !1274, file: !77, line: 1550, type: !252)
!1291 = !DILocation(line: 1550, column: 30, scope: !1274)
!1292 = !DILocalVariable(name: "rslt", scope: !1274, file: !77, line: 1552, type: !62)
!1293 = !DILocation(line: 1552, column: 9, scope: !1274)
!1294 = !DILocalVariable(name: "time_sel", scope: !1274, file: !77, line: 1553, type: !17)
!1295 = !DILocation(line: 1553, column: 10, scope: !1274)
!1296 = !DILocalVariable(name: "sen_sel", scope: !1274, file: !77, line: 1554, type: !17)
!1297 = !DILocation(line: 1554, column: 10, scope: !1274)
!1298 = !DILocalVariable(name: "len", scope: !1274, file: !77, line: 1555, type: !17)
!1299 = !DILocation(line: 1555, column: 10, scope: !1274)
!1300 = !DILocation(line: 1551, column: 3, scope: !1274)
!1301 = !DILocation(line: 1558, column: 12, scope: !1274)
!1302 = !DILocation(line: 1558, column: 26, scope: !1274)
!1303 = !DILocation(line: 1558, column: 10, scope: !1274)
!1304 = !DILocation(line: 1559, column: 15, scope: !1274)
!1305 = !DILocation(line: 1559, column: 23, scope: !1274)
!1306 = !DILocation(line: 1559, column: 42, scope: !1274)
!1307 = !DILocation(line: 1559, column: 13, scope: !1274)
!1308 = !DILocation(line: 1559, column: 11, scope: !1274)
!1309 = !DILocation(line: 1560, column: 12, scope: !1274)
!1310 = !DILocation(line: 1560, column: 20, scope: !1274)
!1311 = !DILocation(line: 1560, column: 10, scope: !1274)
!1312 = !DILocation(line: 1561, column: 6, scope: !1313)
!1313 = distinct !DILexicalBlock(scope: !1274, file: !77, line: 1561, column: 6)
!1314 = !DILocation(line: 1561, column: 15, scope: !1313)
!1315 = !DILocation(line: 1561, column: 6, scope: !1274)
!1316 = !DILocation(line: 1562, column: 7, scope: !1313)
!1317 = !DILocation(line: 1562, column: 3, scope: !1313)
!1318 = !DILocation(line: 1565, column: 10, scope: !1319)
!1319 = distinct !DILexicalBlock(scope: !1274, file: !77, line: 1565, column: 6)
!1320 = !DILocation(line: 1565, column: 6, scope: !1274)
!1321 = !DILocation(line: 1566, column: 11, scope: !1322)
!1322 = distinct !DILexicalBlock(scope: !1319, file: !77, line: 1565, column: 19)
!1323 = !DILocation(line: 1566, column: 3, scope: !1322)
!1324 = !DILocation(line: 1569, column: 14, scope: !1325)
!1325 = distinct !DILexicalBlock(scope: !1326, file: !77, line: 1569, column: 8)
!1326 = distinct !DILexicalBlock(scope: !1322, file: !77, line: 1566, column: 20)
!1327 = !DILocation(line: 1569, column: 8, scope: !1326)
!1328 = !DILocation(line: 1570, column: 10, scope: !1325)
!1329 = !DILocation(line: 1570, column: 5, scope: !1325)
!1330 = !DILocation(line: 1572, column: 12, scope: !1325)
!1331 = !DILocation(line: 1572, column: 10, scope: !1325)
!1332 = !DILocation(line: 1573, column: 4, scope: !1326)
!1333 = !DILocation(line: 1576, column: 13, scope: !1334)
!1334 = distinct !DILexicalBlock(scope: !1326, file: !77, line: 1576, column: 8)
!1335 = !DILocation(line: 1576, column: 8, scope: !1326)
!1336 = !DILocation(line: 1577, column: 10, scope: !1334)
!1337 = !DILocation(line: 1577, column: 5, scope: !1334)
!1338 = !DILocation(line: 1579, column: 12, scope: !1334)
!1339 = !DILocation(line: 1579, column: 10, scope: !1334)
!1340 = !DILocation(line: 1580, column: 4, scope: !1326)
!1341 = !DILocation(line: 1583, column: 14, scope: !1342)
!1342 = distinct !DILexicalBlock(scope: !1326, file: !77, line: 1583, column: 8)
!1343 = !DILocation(line: 1583, column: 23, scope: !1342)
!1344 = !DILocation(line: 1583, column: 33, scope: !1345)
!1345 = !DILexicalBlockFile(scope: !1342, file: !77, discriminator: 1)
!1346 = !DILocation(line: 1583, column: 8, scope: !1347)
!1347 = !DILexicalBlockFile(scope: !1326, file: !77, discriminator: 1)
!1348 = !DILocation(line: 1584, column: 10, scope: !1342)
!1349 = !DILocation(line: 1584, column: 5, scope: !1342)
!1350 = !DILocation(line: 1586, column: 12, scope: !1342)
!1351 = !DILocation(line: 1586, column: 10, scope: !1342)
!1352 = !DILocation(line: 1587, column: 4, scope: !1326)
!1353 = !DILocation(line: 1589, column: 9, scope: !1326)
!1354 = !DILocation(line: 1590, column: 4, scope: !1326)
!1355 = !DILocation(line: 1592, column: 2, scope: !1322)
!1356 = !DILocation(line: 1593, column: 8, scope: !1357)
!1357 = distinct !DILexicalBlock(scope: !1319, file: !77, line: 1592, column: 9)
!1358 = !DILocation(line: 1596, column: 2, scope: !1274)
!1359 = distinct !DISubprogram(name: "get_accel_data", scope: !77, file: !77, line: 3183, type: !1360, isLocal: true, isDefinition: true, scopeLine: 3184, flags: DIFlagPrototyped, isOptimized: false, unit: !76, variables: !175)
!1360 = !DISubroutineType(types: !1361)
!1361 = !{!62, !17, !1277, !252}
!1362 = !DILocalVariable(name: "len", arg: 1, scope: !1359, file: !77, line: 3183, type: !17)
!1363 = !DILocation(line: 3183, column: 38, scope: !1359)
!1364 = !DILocalVariable(name: "accel", arg: 2, scope: !1359, file: !77, line: 3183, type: !1277)
!1365 = !DILocation(line: 3183, column: 70, scope: !1359)
!1366 = !DILocalVariable(name: "dev", arg: 3, scope: !1359, file: !77, line: 3183, type: !252)
!1367 = !DILocation(line: 3183, column: 102, scope: !1359)
!1368 = !DILocalVariable(name: "rslt", scope: !1359, file: !77, line: 3185, type: !62)
!1369 = !DILocation(line: 3185, column: 9, scope: !1359)
!1370 = !DILocalVariable(name: "idx", scope: !1359, file: !77, line: 3186, type: !17)
!1371 = !DILocation(line: 3186, column: 10, scope: !1359)
!1372 = !DILocalVariable(name: "time_0", scope: !1359, file: !77, line: 3188, type: !17)
!1373 = !DILocation(line: 3188, column: 10, scope: !1359)
!1374 = !DILocalVariable(name: "time_1", scope: !1359, file: !77, line: 3189, type: !47)
!1375 = !DILocation(line: 3189, column: 11, scope: !1359)
!1376 = !DILocalVariable(name: "time_2", scope: !1359, file: !77, line: 3190, type: !55)
!1377 = !DILocation(line: 3190, column: 11, scope: !1359)
!1378 = !DILocalVariable(name: "lsb", scope: !1359, file: !77, line: 3191, type: !17)
!1379 = !DILocation(line: 3191, column: 10, scope: !1359)
!1380 = !DILocalVariable(name: "msb", scope: !1359, file: !77, line: 3192, type: !17)
!1381 = !DILocation(line: 3192, column: 10, scope: !1359)
!1382 = !DILocalVariable(name: "msblsb", scope: !1359, file: !77, line: 3193, type: !121)
!1383 = !DILocation(line: 3193, column: 10, scope: !1359)
!1384 = !DILocation(line: 3184, column: 3, scope: !1359)
!1385 = !DILocalVariable(name: "data_array", scope: !1359, file: !77, line: 3187, type: !1386)
!1386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 72, elements: !1387)
!1387 = !{!1388}
!1388 = !DISubrange(count: 9)
!1389 = !DILocation(line: 3187, column: 10, scope: !1359)
!1390 = !DILocation(line: 3196, column: 49, scope: !1359)
!1391 = !DILocation(line: 3196, column: 65, scope: !1359)
!1392 = !DILocation(line: 3196, column: 63, scope: !1359)
!1393 = !DILocation(line: 3196, column: 61, scope: !1359)
!1394 = !DILocation(line: 3196, column: 9, scope: !1359)
!1395 = !DILocation(line: 3196, column: 7, scope: !1359)
!1396 = !DILocation(line: 3197, column: 6, scope: !1397)
!1397 = distinct !DILexicalBlock(scope: !1359, file: !77, line: 3197, column: 6)
!1398 = !DILocation(line: 3197, column: 11, scope: !1397)
!1399 = !DILocation(line: 3197, column: 6, scope: !1359)
!1400 = !DILocation(line: 3200, column: 23, scope: !1401)
